{"mostReviewed":{"app":"Facebook","category":"SOCIAL","rating":4.1,"reviews":78128208,"size":"Varies with device","installs":"1,000,000,000+","type":"FREE","price":"$0","contentRating":{"category":"Teen","assertion":"-","lowerLimit":"-"},"genres":["Social"],"lastUpdated":1533234590000,"currentVersion":"Varies with device","androidVersion":"Varies with device","translatedReviews":[{"review":"If I open link different browser, refreshes feed I scroll back find I previously at. Now \"updated\" notifications completely screwed order notifications new notifications show chronological order. Makes ZERO sense I hunt old notifications find new ones. No likes algorithms, make user friendly. After 3 years using app, I'm ready stop using again.","sentiment":"POSITIVE"},{"review":"I believe lot Google need slow little. There enough recent improvements satisfy social media world time being. Let us digest latest exponential leaps brilliant design development user friendly fixes wiring. I mean, EVERY WEEK !","sentiment":"POSITIVE"},{"review":"I know went wrong app. I issues facebook visit phone..the hand laggy, load content properly lot times worst. I get notifications timely, want open rgem, facebook refuses load them. Bad basically, dislike it. I hope update properly soon","sentiment":"NEGATIVE"},{"review":"1 star can't move photos timeline post album. Would hard add, edit options, add album option??? forget add post album literrally delete post recreate add timeline photos album. Sometimes I get feeling stupid people create apps. Look reviews online. Everyone complaining years squat. Not first time happens me.","sentiment":"NEGATIVE"},{"review":"This used work well, past 2 months I gotten notifications responses I've received, I able view replies posted majority posts I read. I can't even taken directly comment I made activity log. I already put support ticket nothing done fix issues.","sentiment":"POSITIVE"},{"review":"This lot problems. The irritating thing tag someone video post, reply, go notifications pops video replays it. It doesnt go directly comment someone replied to. So search comments find it. Also still winter themed colored posts literally August. Why dont cute ones like cactus emoji background options posts?","sentiment":"POSITIVE"},{"review":"Like wont let post pics groups select pic gallery hit share facebook, give option share profile, group, page, anything. If go group make post search pictures. But ha e many pics phone would take forever scroll whole camera roll. Why cant post groups gallery anymore?","sentiment":"POSITIVE"},{"review":"Who made latest update, high school summer student? Still can't read comments there. Writing comments awful, camera/gif icons disappear every letter typed reappear letter typed. Better include warning people epilepsy. Have un text box multiple times keyboard show up. Ugh. Samsung Galaxy 7 user here.","sentiment":"POSITIVE"},{"review":"Hope option easy quick selected delete messages selecting delete messages Facebook messenger going delete messages select delete conversation boring tired it.. love give 5 star suggestion would happen soon possible.. may god bless you.","sentiment":"NEGATIVE"},{"review":"COME ON!!! SINCE LAST UPDATE, IT CLOSES, MARKETPLACE IS ACTING UP & MOST RECENTS AREN'T SHOWING LIKE THEY SHOULD! GET IT TOGETHER FACEBOOK! * FIX, FIX, FIX!!!!!! WAY TOO MANY BUGS! CAN'T POST MORE THAN 30 PHOTOS(EVEN IN AN ALBUM POST), RUNNING SLOW, STOPPING, AND SO ON! THERE'S TOO MUCH TECHNOLOGY TO HAVE SO MANY ISSUES WITH SOMETHING LIKE FACEBOOK!","sentiment":"POSITIVE"},{"review":"I updated Facebook still way find marketplace. I go Google mobile Facebook order find marketplace. This never issue I ipad. Please add icon somewhere (either top notification bell list thing log opinion).","sentiment":"POSITIVE"},{"review":"Has marketplace icon account. Wife access account using phone, I know issue phone. Googled TONS people issue nobody really knows solve looks like developers care less.","sentiment":"POSITIVE"},{"review":"This awesome, keeping connected friends family. One problem I'm never before...when I try see reply something comes blank I keep retiring sometimes finally get it, starting get annoying. Anyone else problem?","sentiment":"POSITIVE"},{"review":"Uninstalled...again. It would better brought back working Most Recent option news feed. Seriously, Top Stories sucks. I want see posted chronological order, stuff 4 days ago. That bad enough, blitzing links open externally option sealed deal. I want FB option easy solution dispose source. Get act together. Literally every update worse last!","sentiment":"POSITIVE"},{"review":"I'm tired constant updates... needs fixed. I can't see photos separately, I I'm told Facebook responding kicks out. And kick (which rare) I can't see brings marketplace I even get see that... side page. FIX THE DAMN ISSUES AND QUIT SCREWING AROUND WITH IT.","sentiment":"NEGATIVE"},{"review":"Doesn't post items posted! Keeps showing content!! Problems logging out!! Is bowing pressure Governments NOT designed for, getting people talking things affect lives!! No longer free speach advert concerned ! Used A GREAT WAY inform people thing's could help, sadly changed worst!!","sentiment":"NEGATIVE"},{"review":"Can please quit auto refresh irritating. I know bots giving five stars keeps changing things asked for. I wish better control audience like web. Those complaints actually able customize timeline make recent activity default. Now I'm done","sentiment":"POSITIVE"},{"review":"Since recent updates bloody stupid thing tells someone commented status mine I notification refuses show comments. Also, I watch video full screen FB I can't back come completely (and therefore lose video I watching refreshes itself).","sentiment":"NEGATIVE"},{"review":"People seem ignorant permissions mean. It doesnt mean take video pictures without knowledge. It means want take picture video, allowed let open camera Facebook.","sentiment":"NEGATIVE"},{"review":"After recent updates I unable see posts notifications. I see notification I tap nothing appears \"from notifications\" section group/page. Also frustrating able see recent posts groups. Whoever's making decisions aesthetics basic functions needs replaced someone actually competent. Cheers","sentiment":"POSITIVE"},{"review":"The ads FB videos worst idea may come with. This extremely invasive strategy make people watch ads involuntarily. Whenever I'm watching video I forced see ads I want to. This disgrace best social network past years.","sentiment":"NEGATIVE"},{"review":"recent updates, makes noises every time I like comment post. I CAN'T FIND WHERE TO TURN THESE OFF!!!! Also, I try read comments, I careful I tap, else I get blank scree. Please, please least give back option turn &**!%(#$& noises. Also, 'bout newsfeed settings, let elect ALWAYS HAVE NEWEST FIRST. Screw algorithms--- terrible job guessing I want read.","sentiment":"NEGATIVE"},{"review":"I love Facebook. It place friends could share doing. But sadly I'm seeing effect go away. I would like see friends rather share honestly. Also story feature produces blurry photos phone. Please fix! I want survive.","sentiment":"POSITIVE"},{"review":"Why tell everytime I cant change name already changed I wait 60 days...why somebody else access account. Also heart emojis...this fb sucks big time","sentiment":"NEGATIVE"},{"review":"After updates, I can't even load home screen way. When I got see picture I can't put options it. If I go visit person's profile profile load up. These updates garbage Galaxy s8","sentiment":"NEUTRAL"},{"review":"It's best social network doubt. But stopped development rising country. Cause! Some ultra crazy young generation always busy using this. So wasting much time here.","sentiment":"POSITIVE"},{"review":"Recent updates made using connect friends pages I interest difficult - news feed shows several day old posts, neglects even include pages I follow instead floods feed adverts promoting pages/posts. It's point I even bother - I see friends moving social media platforms Facebook.","sentiment":"NEGATIVE"},{"review":"What Facebook sorting news feed chronologically?? Most time, pressing \"most recent\" button leads sad cloud says \"can't connect\". When work, news top hours old refreshing rings different hours-old post top feed.","sentiment":"POSITIVE"},{"review":"Now deleted \"always open external browser\" function. Now always open manually open links. It's time sell shares. No improvement point, getting ridiculous update.","sentiment":"NEGATIVE"},{"review":"nan","sentiment":"-"},{"review":"Can't upload photos within forces closed every time even full restart cache clear. Slow times unresponsive. And feel tip stories default option everyone open app?! Who cares stories sometimes week plus old! I want see recent items go options see feed. Fix please Update..... Now I see nothing notifications groups. Please fix juts gone bad worse. Then probably actually care otherwise addressed give I'm issue","sentiment":"NEGATIVE"},{"review":"For reason since updates S8+ I longer add pictures via comment. It works I uninstall downgrade. The basis update expect everything improvements get worse. Absolutely useless.....","sentiment":"NEGATIVE"},{"review":"recent updated worst version facebook. I really miss days lags advertisement videos. Got fed much problems new version.","sentiment":"NEGATIVE"},{"review":"Do understand hindi? If understand problem meme's If I want to do so, I will be able to tag you. We show you what to do with the frnds in our country. Please do not hesitate to send me the name of this option as I would like to see if you have any questions. If soloution problem give star","sentiment":"POSITIVE"},{"review":"Doesn't allow majority things. Doesn't load new posts. Have go version properly. Disappointing massive company sub par app.","sentiment":"NEGATIVE"},{"review":"Why can't guys get together, guys still give problem refreshing newsfeed me. I'll literally middle watching something boom, refreshed, like Twitter I'm taking business back them, like years. Another thing, every video lags, Wi-Fi, Instagram, Twitter. Nothing else this, guys suck.","sentiment":"POSITIVE"},{"review":"Why can't I see replies? I'm sorry actually I I comment look replies back half hour I'll see replies said comment. So frustrating, absolutely rubbish","sentiment":"NEGATIVE"},{"review":"nan","sentiment":"-"},{"review":"I facebook kill time I'm bored keep current events. But lately, wont load comments, showing videos. It's black screen. I spend much time anyways. I'll deleting checking desktop periodically. But probably fix bug. It's steadily getting worse time goes on.","sentiment":"NEGATIVE"},{"review":"Deleted facebook moved Instagram. Facebook total b.s. nowadays. Since NOW deletion option, I dropping facebook. Facebook 10 years old ran course. Moved easier better things.","sentiment":"POSITIVE"},{"review":"crashing moto g","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"},{"review":"Cannot anything anymore. Tries ages load crashes. Each update gets worse. I closing facebook account. No point anymore.","sentiment":"NEGATIVE"},{"review":"Stuck 97% update. Haven't able get fb days :(","sentiment":"NEGATIVE"},{"review":"My Facebook, hacked. I limited access. Help.","sentiment":"NEGATIVE"},{"review":"It work AT ALL. Keeps spinning. 2 days now.","sentiment":"NEUTRAL"},{"review":"Not loading, 18 hrs! Help!","sentiment":"NEUTRAL"},{"review":"Crashes hardly ever updates correctly","sentiment":"NEGATIVE"},{"review":"Since update I cannot open Facebook. It stays buffering screen nothing happens.","sentiment":"NEUTRAL"},{"review":"The best free","sentiment":"POSITIVE"},{"review":"Cant even open","sentiment":"NEUTRAL"},{"review":"Ever since last update load!","sentiment":"NEUTRAL"},{"review":"Won't load anymore since update","sentiment":"NEUTRAL"},{"review":"Beautiful and sweet. *","sentiment":"POSITIVE"},{"review":"facebook excellence connect friends families","sentiment":"NEUTRAL"},{"review":"Hey happened?? Since updated 2 days ago FB even open, stuck opening logo. Now new update released, successful 99% stuck. Pls fix it, 3 days I'm unable access FB!!!","sentiment":"NEGATIVE"},{"review":"Since updated. It stuck buffering screen. And updating stuck.to 99% only. Not going that. What happening days. Its creating much problem. Pls fix soon possible. And updating too. What beta vesrion. Pls cannot operate since ... Full Review","sentiment":"POSITIVE"},{"review":"Ever since update stuck Facebook logo loading screen","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"},{"review":"Its updating getting stuck 99%.... loading","sentiment":"NEUTRAL"},{"review":"This regularly crashes since latest update","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Just wanna mention airplane react.","sentiment":"NEUTRAL"},{"review":"After new update wont even open","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"opening.","sentiment":"NEUTRAL"},{"review":"Good","sentiment":"POSITIVE"},{"review":"Still receive notifications husband, even though turned on. Now auto updating, setting I turned off, weeks. I like whatever, life anyway FB...but now, open links browser, I 17 open tabs phone, stories I read downtime, want open fb keep friends. Why!??!?!","sentiment":"NEUTRAL"},{"review":"I dont understand pages, people followed showing newsfeed \"public\" put \"only me\". I sent report 3 days ago via report option still fixed. So what's up? So where's essence protecting privacy? Please report fix asap. I can't like pages withut showing newsfeed. And option activity log unlike it. Srsly?","sentiment":"POSITIVE"},{"review":"I've lot issues lately loading kind images whatsoever. I scroll feed see several blank images throughout. At moment I view text. I know suddenly become issue I've given 3 stars instead 5. If issue fixed I correct rating accordingly.","sentiment":"POSITIVE"},{"review":"This worst phone. It's slow load correctly even constantly updating never gets better. Stop making small visual changes. Change works properly. Currently crashes every 6 seconds asking report issue. Idky I waste time","sentiment":"NEGATIVE"},{"review":"Give option entirely delete Samsung s8+. After latest Samsung update fb installed phone can't taken off. You uninstall updates render useless can't take phone. Also I can't see Facebook marketplace? links outside Facebook keeping getting error trying open. fix please","sentiment":"NEUTRAL"},{"review":"For quite I get replies comments, blank screen, even posts. Sometimes go & back 20 times might work. I know lots Facebook friends issue. Sort please getting everyone's nerves.","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"},{"review":"The works well. Facebook needs stop meddling manipulating, respect settings, preferences, time privacy. They constantly add features give access posted. It's potentially security hazard. Every photo take available \"editing\" program instant taken, unless prevent ourselves. Rule thumb: Nothing posted Facebook safe Facebook.","sentiment":"POSITIVE"},{"review":"The heck \"posts across Facebook\" schnitzel? 5 posts friends, immediately followed 400 posts I care less about. Also, key pad pop comments like 84th tap \"write comment\". And H-E-double hockey sticks I still seeing posts pages I've BLOCKED? This stressful man. Every update gets worse worse.","sentiment":"NEGATIVE"},{"review":"You've updated facebook again; fact updates time, time I can't even go it. Every time I show anyone's picture stops closes itself. It keeps saying facebook stopped working. Please fix it, stressing out.","sentiment":"NEUTRAL"},{"review":"Somehow started updating every version WITH OUT PERMISSION! settings say auto update yet still does. also uninstall vanished unless go store. unhappy every time updates something goes wrong I choose perpusly auto update reason. pissed off.","sentiment":"NEGATIVE"},{"review":"I noticed last couple months updates made without permission even though auto-update off. Then today I another update without permission via Facebook manager (Facebook services?!)...I authorize updates I idea updates keep happening. Can Facebook shed light unauthorised updates???!!! Very frustrating","sentiment":"POSITIVE"},{"review":"This awful, since update today I longer open app, crashes. Even phone reboot nothing help. My relationship Facebook pretty rocky moment given news can't even deliver enable users access service, what's point account?","sentiment":"NEGATIVE"},{"review":"Got reported posting picture comment ballchinian, going community \"nudity sexual activity\". This \"community\" really triggered snowflakes all, matter time normal people find alternative platform socialize, expressing rights freedom speech expression.","sentiment":"POSITIVE"},{"review":"Is fb there? It's really starting annoy me. I can't view comments without post back again, least three four times, even sometimes work. It refreshes u want to. And times shows posts week ago nothing newer. Then show adverts old posts I've already seen occasional new post. Think I may go back fb lite","sentiment":"NEGATIVE"},{"review":"Since update 2 days ago I can't read single artical. Everytime I 30 seconds goes grey saying page can't load. Even though already loaded fine. It's beyond annoying","sentiment":"NEGATIVE"},{"review":"Facebook fails regards ensuring profiles legitimate. Their \"community standards\" vague pitiful set rules compared determining validity people reported. Were business I would continue using social media. Shame Facebook allowing people create fake profiles post lies negative things hurt peoples reputations.","sentiment":"NEGATIVE"},{"review":"Well 3 days ago I searched marketplace second hand tv stand daughter's bedroom. Facebook updated today news feed full marketplace posts bloody tv stand anywhere 20 minutes 9 bloody days ago!!! Literally chronological order friends posts would make sort since setting called \"recent\" Just tv stand poxy tv stand! Do devs really think helpfull???? Marketplace posts news feed standard unless choose turn on. Bloody morons charge app!","sentiment":"NEGATIVE"},{"review":"nan","sentiment":"-"},{"review":"The \"news\" feed joke. Facebook insists shoving \"thinks\" I want see. So I always used 'most recent' feed because, shocker, I want see feed chronologically. But getting fowled up! How something posted week ago considered 'more recent'??? And next item 5 minutes, followed 5 hours, followed 20 minutes, on. Ridiculous. I would say getting unusable, version bad, FACEBOOK IS BECOMING UNUSABLE. Plain simple. Another reason I'm surprised stock tanking.","sentiment":"POSITIVE"},{"review":"Thus seems automatically update even turned auto update option. I limited amount internet data want used cause Facebook wants update daily. Please fix cause I'm getting ready delete app. It's frustrating","sentiment":"NEGATIVE"},{"review":"This offers terrible privacy. I can't like something without showing friends feed. This keeps showing scam suggested adds thing I reported multiple times. If Facebook competition good I would go instead.","sentiment":"NEGATIVE"},{"review":"Hey Facebook Devs .. Who told update background without permission? Just time! A notification pop notification bar \"Facebook successfully updated\" What heck? I update .. My Auto Update Play Store .. I usual update Manually .. So ? Huh? Your crashing everytime I open ! Please fix it! Arrghhh!","sentiment":"POSITIVE"},{"review":"There bug whenever I attempt open articles, articles crash saying cant connect check wifi and/or data. Theres nothing wrong connections happens constantly throughout day.","sentiment":"NEGATIVE"},{"review":"Problems started today. Logged let back in. But I log fine. The keeps taking forgot password page saying phone email exist. 8/1/18","sentiment":"POSITIVE"},{"review":"Everytime I video goes suggested videos, I hate put way before... also says error page can't load either close refresh everything working, literally Facebook messing up. Yes I restarted even shut phone period time","sentiment":"NEGATIVE"},{"review":"This worst phone. It's slow load correctly even constantly updating never gets better. Stop making small visual changes. Change works properly. Currently crashes every 6 seconds asking report issue. Idky I waste time","sentiment":"NEGATIVE"},{"review":"Unable view original post photos. More newer app, complicated users. New versions becoming monster ads permissions. FB seems sample gestures really, becomes fragile real life. Peace.","sentiment":"POSITIVE"},{"review":"I can't anything app.. got Galaxy S9 plus can't access Facebook all..keeps saying connection lost EVERYTIME I log in, I know I service. Even fter asking identity authentication questions..which I answered correctly. It sits frozen blue screen.... I pretty bummed..I looking forward using FB new phone.","sentiment":"POSITIVE"},{"review":"Newsfeed shows posts two weeks ago. Have PC see recent posts. Also, I keep getting notifications going phone every time someone comments someone else's post. I go Android settings block notifications get stop. Third, removed ability turn sounds. The developer noob know fix it. Use Twitter instead. Edit: still fixed update.","sentiment":"POSITIVE"},{"review":"Load up, start reading feed exits out. Open back suddenly I can't locate posts I reading. Oops, kicked back again. It's normal crash, restarts. Edit 5/6/2018: It's restarting middle commenting. It's crashing, shutting restarting. It's really pissing off. I'm ready go version instead deleting 500+mb waste space. Update 8/1/2018: The nRwest version Err_Name_Not_Resolved error kicks reading page. I know many times I reload site finish reading article.","sentiment":"POSITIVE"},{"review":"While there's definitely plenty good content here, slowly starting turn something possibly edgy Tumblr... Even report posts flat offensive take seriously.","sentiment":"POSITIVE"},{"review":"When post something sale tell can't posted? Also items tagging people? After comment, show anything unless I I still can't see I'm typing comment, went I can't see post someone tagged unless I go page? Hey remove info marketplace post posted? Now I can't tell that's new garage sale week old. Too bad show reason got bad rating marketplace item for. I liked better clicked three lines go group instead clicking groups finding group. I liked before, would get notification would tell friend area. Can please put time back comments? Instead says 1 hour ago something. Hey would cool, could make spot marketplace auction ship. I like ratings marketplace.","sentiment":"POSITIVE"},{"review":"I like recent update makes go back top news feed every time I'm done looking picture article. I find incredibly frustrating. Other that, fine. I'm thrilled losing place every time I want see read something. Edit- recent update causing crash constantly.","sentiment":"POSITIVE"},{"review":"Since newest update none pictures Profile Pics load stays blank. And everytime I try scroll feed crashes. What heck happened fine days ago latest update","sentiment":"POSITIVE"},{"review":"Ok I'm kinda fed Facebook right now.... I clue I've able update I also know (this also apply tablets, phones wife's.","sentiment":"POSITIVE"},{"review":"Not sure video lagging FB AND IG. Videos work platforms phone. Also typing message comments, wierd can't describe it. Almost hesitate typing.","sentiment":"NEGATIVE"},{"review":"After recent update, every hours so, stops working. Anytime I touch select, registers touch complete function. Have tried uninstall/reinstall still glitching. Truly annoyed. Maybe stop releasing updates every three days......","sentiment":"NEGATIVE"},{"review":"The consistently slow clearing cache, deleting data, reinstalling, even restarting device, constantly loses place posts status updates every update. These issues addressed adding Snapchat clone literally nobody uses already Snapchat that. Updated August 2018: Reinstalled try again, removed option open links externally. I wish I could ask money back, worst GUI ever.","sentiment":"NEGATIVE"},{"review":"The current update sucks forces fb shut scrolling newsfeed. I faced issue Xiaomi Redmi Note 5 Pro device equipped SD 636.","sentiment":"NEGATIVE"},{"review":"Genuinely poor video quality newsfeed. I'm talking uploads, I'm talking people's/pages. I've tried absolutely everything, updating phone app, Clearing cache, deleting reinstalling itself. Nothing! I know fact connection, wifi data, due fact I view videos perfectly fine HD. It's like past couple months. Over it.","sentiment":"NEGATIVE"},{"review":"Thia new update I today really ruined works. It doesnt need fixed :( update makes worse. Now I type comments, text box flashes. I can't get rid notifications either. And now, I figure new windows everything. Haha.","sentiment":"NEGATIVE"},{"review":"It's always gotta something I guess. WHY DID YOU GET RID OF THE THIRD PARTY POSTING I job post 3 5 times day. Thats I make money, personal facebook normally much better group many people see it. And I time every hours make posts. With buffer I had, I could make night schedule pop whenever I wanted I can't. What heck.","sentiment":"POSITIVE"},{"review":"Cannot view pages within Facebook more, keeps giving connectivity/wifi error messages accessing outside content.. funny everything still loads can't read quick enough gives error message.","sentiment":"POSITIVE"},{"review":"Every update getting worst. There date time products Market. It important date included. Before update like hours posted something like \"posted week ago\" please include date tje item posted Market.","sentiment":"NEGATIVE"},{"review":"The recent update sucks. My weird stuff day - comments load, I try type comment screen jumps around... Ridiculous.","sentiment":"NEGATIVE"},{"review":"This seems get updated every day, every update gets worse. Can't watch videos landscape, go link comes message saying closed I wifi connection. How I see link I connection?","sentiment":"NEGATIVE"},{"review":"Most recent posts NOT ones hours days behind current time. This getting annoying. It's stupid scrolling thru old posts someone recently commented liked it. Where's recent post option?","sentiment":"NEGATIVE"},{"review":"Decided simplify review issue. You disconnecting friends. A post three minutes ago might turn 'most recent' feed top 'anybody's guess' ordered feed. Or worse might 30 posts feed beneath load I've already read still nowhere found 'most recent'. All content visible 'most recent' specific order. Let decide I see I interact","sentiment":"POSITIVE"},{"review":"I removed notifications I still getting stupid number showing next app?! It's frustrating open Facebook see someone uploaded new photo I new friend suggestion. If I wanted see I would notifications on. Please fix this, I hate seeing stupid number time especially stupid reasons!","sentiment":"NEGATIVE"},{"review":"terrible. The controls lag disappointing. I also ios much smoother faster. simple things like watching video basic frustrating. Serious fb can't difficult make good ios version. Sort out.","sentiment":"NEGATIVE"},{"review":"From last update videos sound remains playing scrolling news feed overlap videos sound previous video sound stop till close fully Facebook app.. annoying..","sentiment":"POSITIVE"},{"review":"Give option entirely delete Samsung s8+. After latest Samsung update fb installed phone can't taken off. You uninstall updates render useless can't take phone. Also I can't see Facebook marketplace? links outside Facebook keeping getting error trying open. fix please","sentiment":"NEUTRAL"},{"review":"Way intrusive apart slow getting worse since constant update reliability speed. Very annoying update news feed reading that's ignorant. Getting worse every update continuing get worse. Will leave playing video stopped still ignorant problem updating news feeds read something. It's pathetic great long read fast watch video. Have un installed /reinstalled, problems Xperia tablet z. Comments appearing disappearing. 2/8/18 still occurring.","sentiment":"NEGATIVE"},{"review":"Very poor maintenance performance. It can't initiate English UK, past week, shows posts several days ago, order, failing update refresh.","sentiment":"NEGATIVE"},{"review":"This new community standar stupid. They banned posting medical history cancer. Yet thousand nudes photos banned against community standar","sentiment":"NEGATIVE"},{"review":"Would great change constantly. The videos inconsistent. One video take video tab another go full screen preferred.","sentiment":"POSITIVE"},{"review":"They kept removing review. This trash. Hate damn people may know notification tab, matter many time I remove people, keep popping new. Photo comment still folder view. Now annoying red circle messenger icon go away even I've read msg","sentiment":"NEGATIVE"},{"review":"Haven't trouble three weeks ago. Feed update, I uninstalled reinstalled worked normally couple days I can't even log in, says check internet connection I know fact I stellar internet home. Sucks I admin group able contribute lately. Browser version works problem account anything.","sentiment":"POSITIVE"},{"review":"Update 8/3/2018 load feed notification I try open, crashes. I tried clearing cache everything else, seems latest update buggered it.","sentiment":"POSITIVE"},{"review":"I delete completely! These last 2-3 recent updates stuck! Stop trying take much control newsfeed...especially I'm actively looking it! I reading article left page I took back top newsfeed. Wasn't first time happened either. And stop trying tell I'm allowed see anything else I've scrolled ways. Its ridiculous.","sentiment":"POSITIVE"},{"review":"Great lot useless forced features!! Like suggested pages groupes (give people choice disable that!!!) updates frequent annoying.","sentiment":"NEGATIVE"},{"review":"Hi Facebook, far awesome. Just hope Facebook put schedule post Facebook wall Facebook page only. Because block others make schedule post wall time like. With schedule post choose time posting. Hope Facebook thing it. THANK YOU","sentiment":"POSITIVE"},{"review":"New update causing Facebook crash load external articles app. Gives error message option close reload. Reloading brings back error page. Disappointed.","sentiment":"NEGATIVE"},{"review":"It's getting worse every updates. Today got updated either can't opened, crashes immediately open else pictures loaded out. Updates supposed getting better reverse FB team coz everything getting worse.","sentiment":"NEGATIVE"},{"review":"CENSORING CONSERVATOR PAGES.. DELETING PAGES... WITH LAME EXCUSES... (while leftist pages worst things affected.. worst right wing pages lying... unlike leftist pages... ) SOLD TO THE COMMUNISTS.. RIDICULOUS..","sentiment":"NEGATIVE"},{"review":"Some error keeps popping everytime I link saying can't connect error name resolved? My wifi fine page loads perfectly I scroll refreshes error pops different links error I dunno happens I'm facebook","sentiment":"POSITIVE"},{"review":"Facebook auto updated six times within month, Still problems I fixed. This supposed top five Apps used around world absolutely useless!","sentiment":"NEGATIVE"},{"review":"Update. Contant crashing OnePlus 6. Not good. Oh STILL I describe below. What Russians all...why DO I app?! Suddenly, I'm reading article recent feed, Facebook flips away \"important\" feed-- know, feed Facebook selects what's important you. Ugh... weeks now. Annoying.","sentiment":"NEGATIVE"},{"review":"Stop ruining newsfeed replacing \"Posts From Across Facebook\". I want po see posts friends, pages I like grous I joined people I dont know, pages I didnt like groups I didnt join!!!!!!!","sentiment":"NEUTRAL"},{"review":"This sucks. It's buggy tries mislead users. I also understand Facebook circumventing Google Play Store updates offering update mechanism. Sounds like running scripts!","sentiment":"NEGATIVE"},{"review":"Almost glitches. First far glitch is, every time I upload photo facebook, I launch massive search operation list somehow Facebook believe giving options see photographs gallary folder mode. I mean want post picture I save months back relevant posts? Can anything it?","sentiment":"POSITIVE"},{"review":"I stunned bad company (financial) size Facebook. Comments posts load clicked on. Posts disappear one's thread. Posts disappear one's text bar entering (apart arbitrary length string), annoying bugs... Really, show-stopping bugs make hard comprehend even possible without collusion Google's Android platform. Nah, I really share Facebook's blame Google. Google repeatedly thrown adverts face commonly exposed fraudulent. It's Facebook terrible company offers conceptually cool product practically terrible implementation.","sentiment":"NEGATIVE"}],"appSentiment":{"POSITIVE":53,"NEGATIVE":60,"NEUTRAL":19,"-":8}},"leastReviewed":{"app":"Truth or Dare Pro","category":"DATING","rating":0,"reviews":0,"size":"20M","installs":"50+","type":"PAID","price":"$1.49","contentRating":{"category":"Teen","assertion":"-","lowerLimit":"-"},"genres":["Dating"],"lastUpdated":1504204190000,"currentVersion":"1","androidVersion":"4.0 and up","translatedReviews":[],"appSentiment":{"POSITIVE":0,"NEGATIVE":0,"NEUTRAL":0,"-":0}},"bestAppSentiment":{"app":"Helix Jump","category":"GAME","rating":4.2,"reviews":1485806,"size":"33M","installs":"100,000,000+","type":"FREE","price":"$0","contentRating":{"category":"Everyone","assertion":"-","lowerLimit":"-"},"genres":["Action"],"lastUpdated":1523212190000,"currentVersion":"1.0.6","androidVersion":"4.1 and up","translatedReviews":[{"review":"Actually really enjoy playing game, however I paid upgraded version without ads still continued get ads. Emailed developer week ago along attached confirmation purchase never got response, therefore I'm giving star. Just lot downloads mean overlook people support game; especially ones voluntarily pay upgraded version.","sentiment":"NEGATIVE"},{"review":"Update: I finally bought premium version avoid ads I'm still getting ads non stop despite reaching devs responded all. Going request refund I guess. Original review: The game fun addicting, many ads. An ad every time restart level, ad beat level, ad blink many times. I know devs make money game free pretty top","sentiment":"POSITIVE"},{"review":"Hi VOODOO I issues game I press icon everytime I try go game tablet says 'unfortunately helix jump stopped'. I honestly know game made IOS'S Android. I rated five stars u played friends iPhone really good quality. But seemed work perfectly phone tablet. can, reply comment inform happening. Thank","sentiment":"POSITIVE"},{"review":"It's good game much need update. There ads die get next level. When I first started play I went straight game. When game front screen thing. Also I got level 4 phones screen went black screen come back. It's good game lot work. Keep good work!","sentiment":"POSITIVE"},{"review":"I love game seems like thing again. It get harder easier. They even change colors repeat them. It's like loop level say different level. Please make challenging get higher game change maybe different color level. Other wise cool I beat like 6 levels 1 hour!","sentiment":"POSITIVE"},{"review":"Love game - really addictive, could added difficulty levels pass by. My kid plays lot too, I thought \"let's buy full version help developers\". HOWEVER, I paid NO ADDS version, BUT NOTHING CHANGED, adds continue pop usual. Because gets 2 starts :(","sentiment":"NEGATIVE"},{"review":"Ok I enjoying game, fun super addictive. The reason lost star review I keep getting ads middle level, makes lose. I mind ads levels skip 5 seconds cannot deal ads affecting gameplay ruining score.","sentiment":"POSITIVE"},{"review":"I've enjoyed game, giving poor review someone addresses issue. I paid ads removed almost month ago still receiving numerous ads. I've emailed development team Google play store, received response. If nothing changes I'll delete game together leave review permanently","sentiment":"NEGATIVE"},{"review":"Easy good. By way, I've noticed saying score hits 6 digits resets 10000. This true, might noticed points lower time, score still 100k+, fill screen up. E.g. I got score 300k, would say 30000. Hope helps people!","sentiment":"POSITIVE"},{"review":"This game opinion simple fun addicting time . However variety colors \"trap\" positions limited kin getting boring. There also large amount ads even paying remove . And completely honest, I noticed level easiness canged much AT ALL past atleast 30 levels I've played. There define try change otherwise get attention.","sentiment":"NEGATIVE"},{"review":"Like others I bought ad free version continued receiving ads. Then, I contacted devs response. I tried uninstalling reinstalling app, wondering would fix started way back level 1. So, even though clearly communicating Google Play (taking money problem), saving progress. Done filing refund.","sentiment":"POSITIVE"},{"review":"The game play good. My issue even though paid money ad free version, still getting ads hell lot ads gameplay. This clear con. Developers, please either remove option go ad free update support this. I dropped email support team refund response far. please look this. otherwise great simple game. Loved it.","sentiment":"POSITIVE"},{"review":"I really enjoy game. It's great time killer, challenging enough fun. My complaint viewing ad 'second chance', drops right back game, immediately ad closes. It makes 'second chance' kind pointless. I feel brief countdown -- '3, 2, 1' sort thing -- order allow player prepare would improve feature greatly.","sentiment":"POSITIVE"},{"review":"Way many ads liking. This really good fun game, lose about, 3 rounds, gives ad. And ad sit like five seconds wait over, likely going long ad. Please decrease ads pop expect lot people delete game phone. I read reviews I downloaded game I delete endless amount ads drains phone.","sentiment":"POSITIVE"},{"review":"The ads bug me. When pops I close open again. Takes like 2 seconds. But trying get high score cant close lose score. I think colors better backgrounds would make game exciting playing.","sentiment":"POSITIVE"},{"review":"This definitely simple yet addictive games I've ever played. Only catch, I paid remove ads yet I still get them. What gives? And said: no, I mean \"second chance\" button fail. Also, ad bottom screen still I play.","sentiment":"NEGATIVE"},{"review":"The second chance needs countdown start I've many times starts without warning kills instantly. Plus I think need arrow either side screen rotate with. I keep falling multiple floors time I find thumb keeps getting way. Would nicer arrow bottom corners clear play area.","sentiment":"POSITIVE"},{"review":"Ok, I love game, much fun I play hours straight. But waayyyy many ads. like every 3 games there's another ad there's ads bottom screen. I'm going pay ads cuz I feel like waste money time many ads game! I understand ads great way display product people show many ads makes want delete app. I mind ad every ten games so. In addition, I think ads bottom screen get way game. Love game though, fix ads.","sentiment":"POSITIVE"},{"review":"It started great ads tolerable. Lately (on level 30+), I cannot go level without trying open Chrome tab advert (constantly!). This I die, new level, I jumping pass around 30%, it'll randomly open advert phone, even I follow till final pop up, soon I return game, open new one.","sentiment":"POSITIVE"},{"review":"Game fun addicting, receiving low score many ads. I purchased premium No Ads option nothing changed. I charged purchase, despite trying contact developers 3 times last month I received response. No Ads option SCAM! Please take Ads away give refund!!!","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Not bad game start with, I fun competing half unfortunately latest update killed it. Levels became shorter easier meaning I sailed level 40 level 200 rapidly. Ads bearing. Complete level, get two ads. Lose life, another two ads. Half way turn, another ad...","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"I actually really enjoy game, I agree ads waaaaay many much. But I like game much I willing pay higher-than-average cost ad-free. However, I paid remove ads I still ads. The charge went card, I \"no ads\" button again, anything. And yet.. still ads. I revise review 5 stars ads removed like be.","sentiment":"POSITIVE"},{"review":"I Would've loved give game better review, Ads Non stop ruin game expierance completely. If I skip second chance ad gives another Ad immediately I start level without reward it, add fact Ads 30 seconds unskippable. Like said, would've loved give higher rating, Ads make unbearable.","sentiment":"POSITIVE"},{"review":"Simple, fun, addictive asks well made game. So good I paid add-free version. Only reasons get 5 star because, sometimes (when I'm online) I still get ads. Also there's way go back replay competed levels.","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Downloaded game three weeks ago. I totally love it. Im level 64 already (probably good compared some!) score far 11004. Whomever ever created game...well done. Its relaxing way pass free time. It doesnt kill battery phone either.","sentiment":"POSITIVE"},{"review":"I addicted time. I told myself, I made 1,000,000 points, I would quit playing. I accomplished objective. It fun ride. Nothing seems change game bugs me. I eventually started trying best high scores. Many headaches later, level 1000-something, high score 1,000,000-something, I'm done. It good game. Has anyone else gotten 1,000,000?","sentiment":"POSITIVE"},{"review":"I love zenlike game play. I enjoy challenge albeit light skill level needed anyone age 11yo. What I like best I sit play without much thought zone I need to. Don't waste money buying \"ad free\" version. You still get many ads would using free version, thats complaint.","sentiment":"POSITIVE"},{"review":"DO NOT PAY FOR THIS. I much difficulty trying pay full version. I'm kidding I sat entire day waiting work. When I purchased ad buttons still there, made sounds pressed. I trying find number contact Google tell mad I was. Finally restarting phone fixed it, way I've seen reviews, seems work many people. Therefore, I cannot recommend playing purchasing app. I refund hassle all, I agree reviews answer support email. Everything people say true. Do buy it. UPDATE: seems like I give permissions ask for, continue play ads. It also true ask many permissions. DON'T PLAY THIS! And I definitely ask refund.","sentiment":"POSITIVE"},{"review":"The game good fun. However allowed astronomical amount ads pop ruins fun try force go ad free. The game fun fun enough spend money make ad free. Due extremely large amount ads trying force us buy game, rate 1/5. Otherwise without ads (some ads understand, like every 20 seconds pop up) would gave 3/5","sentiment":"POSITIVE"},{"review":"It goodgame kind addictive. There many ads I know whether phone seems lot lag times? The second chance feature count rather throwing straight back in.","sentiment":"POSITIVE"},{"review":"PAYING TO REMOVE THE ADS DOES NOT WORK! This addicting fun game, issue many ads. As many games I play, I mind spending dollars remove ads... BUT IT DIDN'T REMOVE THE ADS! I still get amount ads, continually banner bottom videos levels. Paying ads nothing. The developer respond, past 48 hours get refund Google. If paying ads actually removed ads, would probably 5 star review!","sentiment":"POSITIVE"},{"review":"Game fun. But many ads! They happen lose go next level. I play 5 minutes. And ads close, wait 10-15 seconds time. And encounter add every 30 seconds (you either lose go level).","sentiment":"POSITIVE"},{"review":"This game would awesome paid $2.49 remove ads, ads actually removed. And what's permissions? Why need access contacts, location, AND phone calls? And still reply dev? Would better would make buttons work. It even restore.","sentiment":"POSITIVE"},{"review":"Great game many ads. I paid $2.49 ad free I still get many before. Tried contacting developer twice last two days response. This seems happening everyone else well. It would easily 5 stars blatantly rob people supporting content. Contacting Google I hear back Voodoo within next days.","sentiment":"POSITIVE"},{"review":"Its unbelievable amount adds. The game pretty fun honestly I could play hours end, fact I constantly assaulted adds. There already static add bottom game play choice watch add get new life fine good, top time fail instantly transported add cant get of. Its ridiculous. I spent time trying get adds game play","sentiment":"POSITIVE"},{"review":"This game bores never-ending ads. If decide buy NO ADS, charge money ads still stay there, multiplied. Their support never responds emails. If going play offline, fun relaxing game kill time. If need stay online... Then better something else.","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"},{"review":"Actually really enjoy playing game, however I paid upgraded version without ads still continued get ads. Emailed developer week ago along attached confirmation purchase never got response, therefore I'm giving star. Just lot downloads mean overlook people support game; especially ones voluntarily pay upgraded version.","sentiment":"NEGATIVE"},{"review":"Update: I finally bought premium version avoid ads I'm still getting ads non stop despite reaching devs responded all. Going request refund I guess. Original review: The game fun addicting, many ads. An ad every time restart level, ad beat level, ad blink many times. I know devs make money game free pretty top","sentiment":"POSITIVE"},{"review":"Hi VOODOO I issues game I press icon everytime I try go game tablet says 'unfortunately helix jump stopped'. I honestly know game made IOS'S Android. I rated five stars u played friends iPhone really good quality. But seemed work perfectly phone tablet. can, reply comment inform happening. Thank","sentiment":"POSITIVE"},{"review":"It's good game much need update. There ads die get next level. When I first started play I went straight game. When game front screen thing. Also I got level 4 phones screen went black screen come back. It's good game lot work. Keep good work!","sentiment":"POSITIVE"},{"review":"I love game seems like thing again. It get harder easier. They even change colors repeat them. It's like loop level say different level. Please make challenging get higher game change maybe different color level. Other wise cool I beat like 6 levels 1 hour!","sentiment":"POSITIVE"},{"review":"Love game - really addictive, could added difficulty levels pass by. My kid plays lot too, I thought \"let's buy full version help developers\". HOWEVER, I paid NO ADDS version, BUT NOTHING CHANGED, adds continue pop usual. Because gets 2 starts :(","sentiment":"NEGATIVE"},{"review":"Ok I enjoying game, fun super addictive. The reason lost star review I keep getting ads middle level, makes lose. I mind ads levels skip 5 seconds cannot deal ads affecting gameplay ruining score.","sentiment":"POSITIVE"},{"review":"I've enjoyed game, giving poor review someone addresses issue. I paid ads removed almost month ago still receiving numerous ads. I've emailed development team Google play store, received response. If nothing changes I'll delete game together leave review permanently","sentiment":"NEGATIVE"},{"review":"Easy good. By way, I've noticed saying score hits 6 digits resets 10000. This true, might noticed points lower time, score still 100k+, fill screen up. E.g. I got score 300k, would say 30000. Hope helps people!","sentiment":"POSITIVE"},{"review":"This game opinion simple fun addicting time . However variety colors \"trap\" positions limited kin getting boring. There also large amount ads even paying remove . And completely honest, I noticed level easiness canged much AT ALL past atleast 30 levels I've played. There define try change otherwise get attention.","sentiment":"NEGATIVE"},{"review":"Like others I bought ad free version continued receiving ads. Then, I contacted devs response. I tried uninstalling reinstalling app, wondering would fix started way back level 1. So, even though clearly communicating Google Play (taking money problem), saving progress. Done filing refund.","sentiment":"POSITIVE"},{"review":"The game play good. My issue even though paid money ad free version, still getting ads hell lot ads gameplay. This clear con. Developers, please either remove option go ad free update support this. I dropped email support team refund response far. please look this. otherwise great simple game. Loved it.","sentiment":"POSITIVE"},{"review":"I really enjoy game. It's great time killer, challenging enough fun. My complaint viewing ad 'second chance', drops right back game, immediately ad closes. It makes 'second chance' kind pointless. I feel brief countdown -- '3, 2, 1' sort thing -- order allow player prepare would improve feature greatly.","sentiment":"POSITIVE"},{"review":"Way many ads liking. This really good fun game, lose about, 3 rounds, gives ad. And ad sit like five seconds wait over, likely going long ad. Please decrease ads pop expect lot people delete game phone. I read reviews I downloaded game I delete endless amount ads drains phone.","sentiment":"POSITIVE"},{"review":"The ads bug me. When pops I close open again. Takes like 2 seconds. But trying get high score cant close lose score. I think colors better backgrounds would make game exciting playing.","sentiment":"POSITIVE"},{"review":"This definitely simple yet addictive games I've ever played. Only catch, I paid remove ads yet I still get them. What gives? And said: no, I mean \"second chance\" button fail. Also, ad bottom screen still I play.","sentiment":"NEGATIVE"},{"review":"The second chance needs countdown start I've many times starts without warning kills instantly. Plus I think need arrow either side screen rotate with. I keep falling multiple floors time I find thumb keeps getting way. Would nicer arrow bottom corners clear play area.","sentiment":"POSITIVE"},{"review":"Ok, I love game, much fun I play hours straight. But waayyyy many ads. like every 3 games there's another ad there's ads bottom screen. I'm going pay ads cuz I feel like waste money time many ads game! I understand ads great way display product people show many ads makes want delete app. I mind ad every ten games so. In addition, I think ads bottom screen get way game. Love game though, fix ads.","sentiment":"POSITIVE"},{"review":"It started great ads tolerable. Lately (on level 30+), I cannot go level without trying open Chrome tab advert (constantly!). This I die, new level, I jumping pass around 30%, it'll randomly open advert phone, even I follow till final pop up, soon I return game, open new one.","sentiment":"POSITIVE"},{"review":"Game fun addicting, receiving low score many ads. I purchased premium No Ads option nothing changed. I charged purchase, despite trying contact developers 3 times last month I received response. No Ads option SCAM! Please take Ads away give refund!!!","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Not bad game start with, I fun competing half unfortunately latest update killed it. Levels became shorter easier meaning I sailed level 40 level 200 rapidly. Ads bearing. Complete level, get two ads. Lose life, another two ads. Half way turn, another ad...","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"I actually really enjoy game, I agree ads waaaaay many much. But I like game much I willing pay higher-than-average cost ad-free. However, I paid remove ads I still ads. The charge went card, I \"no ads\" button again, anything. And yet.. still ads. I revise review 5 stars ads removed like be.","sentiment":"POSITIVE"},{"review":"I Would've loved give game better review, Ads Non stop ruin game expierance completely. If I skip second chance ad gives another Ad immediately I start level without reward it, add fact Ads 30 seconds unskippable. Like said, would've loved give higher rating, Ads make unbearable.","sentiment":"POSITIVE"},{"review":"Simple, fun, addictive asks well made game. So good I paid add-free version. Only reasons get 5 star because, sometimes (when I'm online) I still get ads. Also there's way go back replay competed levels.","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Downloaded game three weeks ago. I totally love it. Im level 64 already (probably good compared some!) score far 11004. Whomever ever created game...well done. Its relaxing way pass free time. It doesnt kill battery phone either.","sentiment":"POSITIVE"},{"review":"I addicted time. I told myself, I made 1,000,000 points, I would quit playing. I accomplished objective. It fun ride. Nothing seems change game bugs me. I eventually started trying best high scores. Many headaches later, level 1000-something, high score 1,000,000-something, I'm done. It good game. Has anyone else gotten 1,000,000?","sentiment":"POSITIVE"},{"review":"I love zenlike game play. I enjoy challenge albeit light skill level needed anyone age 11yo. What I like best I sit play without much thought zone I need to. Don't waste money buying \"ad free\" version. You still get many ads would using free version, thats complaint.","sentiment":"POSITIVE"},{"review":"DO NOT PAY FOR THIS. I much difficulty trying pay full version. I'm kidding I sat entire day waiting work. When I purchased ad buttons still there, made sounds pressed. I trying find number contact Google tell mad I was. Finally restarting phone fixed it, way I've seen reviews, seems work many people. Therefore, I cannot recommend playing purchasing app. I refund hassle all, I agree reviews answer support email. Everything people say true. Do buy it. UPDATE: seems like I give permissions ask for, continue play ads. It also true ask many permissions. DON'T PLAY THIS! And I definitely ask refund.","sentiment":"POSITIVE"},{"review":"The game good fun. However allowed astronomical amount ads pop ruins fun try force go ad free. The game fun fun enough spend money make ad free. Due extremely large amount ads trying force us buy game, rate 1/5. Otherwise without ads (some ads understand, like every 20 seconds pop up) would gave 3/5","sentiment":"POSITIVE"},{"review":"It goodgame kind addictive. There many ads I know whether phone seems lot lag times? The second chance feature count rather throwing straight back in.","sentiment":"POSITIVE"},{"review":"PAYING TO REMOVE THE ADS DOES NOT WORK! This addicting fun game, issue many ads. As many games I play, I mind spending dollars remove ads... BUT IT DIDN'T REMOVE THE ADS! I still get amount ads, continually banner bottom videos levels. Paying ads nothing. The developer respond, past 48 hours get refund Google. If paying ads actually removed ads, would probably 5 star review!","sentiment":"POSITIVE"},{"review":"Game fun. But many ads! They happen lose go next level. I play 5 minutes. And ads close, wait 10-15 seconds time. And encounter add every 30 seconds (you either lose go level).","sentiment":"POSITIVE"},{"review":"This game would awesome paid $2.49 remove ads, ads actually removed. And what's permissions? Why need access contacts, location, AND phone calls? And still reply dev? Would better would make buttons work. It even restore.","sentiment":"POSITIVE"},{"review":"Great game many ads. I paid $2.49 ad free I still get many before. Tried contacting developer twice last two days response. This seems happening everyone else well. It would easily 5 stars blatantly rob people supporting content. Contacting Google I hear back Voodoo within next days.","sentiment":"POSITIVE"},{"review":"Its unbelievable amount adds. The game pretty fun honestly I could play hours end, fact I constantly assaulted adds. There already static add bottom game play choice watch add get new life fine good, top time fail instantly transported add cant get of. Its ridiculous. I spent time trying get adds game play","sentiment":"POSITIVE"},{"review":"This game bores never-ending ads. If decide buy NO ADS, charge money ads still stay there, multiplied. Their support never responds emails. If going play offline, fun relaxing game kill time. If need stay online... Then better something else.","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"},{"review":"Actually really enjoy playing game, however I paid upgraded version without ads still continued get ads. Emailed developer week ago along attached confirmation purchase never got response, therefore I'm giving star. Just a... Full Review","sentiment":"POSITIVE"},{"review":"Update: I finally bought premium version avoid ads I'm still getting ads non stop despite reaching devs responded all. Going request refund I guess. Original review: The game fun addicting, many ads. An ad every time restart level, ad beat level, ad blink many times. I know devs make money game free pretty top","sentiment":"POSITIVE"},{"review":"Hi VOODOO I issues game I press icon everytime I try go game tablet says 'unfortunately helix jump stopped'. I honestly know game made IOS'S Android. I rated five stars u played friends iPhone really good quality. But seemed work perfectly phone tablet. can, reply comment inform happening. Thank","sentiment":"POSITIVE"},{"review":"It's good game much need update. There ads die get next level. When I first started play I went straight game. When game front screen thing. Also I got level 4 phones screen went black screen come back. It's good game lot work. Keep good work!","sentiment":"POSITIVE"},{"review":"I love game seems like thing again. It get harder easier. They even change colors repeat them. It's like loop level say different level. Please make challenging get higher game change maybe different color level. Other wise cool I beat like 6 levels 1 hour!","sentiment":"POSITIVE"},{"review":"Love game - really addictive, could added difficulty levels pass by. My kid plays lot too, I thought \"let's buy full version help developers\". HOWEVER, I paid NO ADDS version, BUT NOTHING CHANGED, adds continue pop usual. Because gets 2 starts :(","sentiment":"NEGATIVE"},{"review":"Ok I enjoying game, fun super addictive. The reason lost star review I keep getting ads middle level, makes lose. I mind ads levels skip 5 seconds cannot deal ads affecting gameplay ruining score.","sentiment":"POSITIVE"},{"review":"I've enjoyed game, giving poor review someone addresses issue. I paid ads removed almost month ago still receiving numerous ads. I've emailed development team Google play store, received response. If nothing changes I'll delete game together leave review permanently","sentiment":"NEGATIVE"},{"review":"Easy good. By way, I've noticed saying score hits 6 digits resets 10000. This true, might noticed points lower time, score still 100k+, fill screen up. E.g. I got score 300k, would say 30000. Hope helps people!","sentiment":"POSITIVE"},{"review":"This game opinion simple fun addicting time . However variety colors \"trap\" positions limited kin getting boring. There also large amount ads even paying remove . And completely honest, I noticed level easiness canged much AT ALL past atleast 30 levels I've played. There define try change otherwise get attention.","sentiment":"NEGATIVE"},{"review":"Like others I bought ad free version continued receiving ads. Then, I contacted devs response. I tried uninstalling reinstalling app, wondering would fix started way back level 1. So, even though clearly communicating Google Play (taking money problem), saving progress. Done filing refund.","sentiment":"POSITIVE"},{"review":"The game play good. My issue even though paid money ad free version, still getting ads hell lot ads gameplay. This clear con. Developers, please either remove option go ad free update support this. I dropped email support team refund response far. please look this. otherwise great simple game. Loved it.","sentiment":"POSITIVE"},{"review":"I really enjoy game. It's great time killer, challenging enough fun. My complaint viewing ad 'second chance', drops right back game, immediately ad closes. It makes 'second chance' kind pointless. I feel brief countdown -- '3, 2, 1' sort thing -- order allow player prepare would improve feature greatly.","sentiment":"POSITIVE"},{"review":"Way many ads liking. This really good fun game, lose about, 3 rounds, gives ad. And ad sit like five seconds wait over, likely going long ad. Please decrease ads pop expect lot people delete game phone. I read reviews I downloaded game I delete endless amount ads drains phone.","sentiment":"POSITIVE"},{"review":"The ads bug me. When pops I close open again. Takes like 2 seconds. But trying get high score cant close lose score. I think colors better backgrounds would make game exciting playing.","sentiment":"POSITIVE"},{"review":"This definitely simple yet addictive games I've ever played. Only catch, I paid remove ads yet I still get them. What gives? And said: no, I mean \"second chance\" button fail. Also, ad bottom screen still I play.","sentiment":"NEGATIVE"},{"review":"The second chance needs countdown start I've many times starts without warning kills instantly. Plus I think need arrow either side screen rotate with. I keep falling multiple floors time I find thumb keeps getting way. Would nicer arrow bottom corners clear play area.","sentiment":"POSITIVE"},{"review":"Ok, I love game, much fun I play hours straight. But waayyyy many ads. like every 3 games there's another ad there's ads bottom screen. I'm going pay ads cuz I feel like waste money time many ads game! I understand ads great way display product people show many ads makes want delete app. I mind ad every ten games so. In addition, I think ads bottom screen get way game. Love game though, fix ads.","sentiment":"POSITIVE"},{"review":"It started great ads tolerable. Lately (on level 30+), I cannot go level without trying open Chrome tab advert (constantly!). This I die, new level, I jumping pass around 30%, it'll randomly open advert phone, even I follow till final pop up, soon I return game, open new one.","sentiment":"POSITIVE"},{"review":"Game fun addicting, receiving low score many ads. I purchased premium No Ads option nothing changed. I charged purchase, despite trying contact developers 3 times last month I received response. No Ads option SCAM! Please take Ads away give refund!!!","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Not bad game start with, I fun competing half unfortunately latest update killed it. Levels became shorter easier meaning I sailed level 40 level 200 rapidly. Ads bearing. Complete level, get two ads. Lose life, another two ads. Half way turn, another ad...","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"I actually really enjoy game, I agree ads waaaaay many much. But I like game much I willing pay higher-than-average cost ad-free. However, I paid remove ads I still ads. The charge went card, I \"no ads\" button again, anything. And yet.. still ads. I revise review 5 stars ads removed like be.","sentiment":"POSITIVE"},{"review":"I Would've loved give game better review, Ads Non stop ruin game expierance completely. If I skip second chance ad gives another Ad immediately I start level without reward it, add fact Ads 30 seconds unskippable. Like said, would've loved give higher rating, Ads make unbearable.","sentiment":"POSITIVE"},{"review":"Simple, fun, addictive asks well made game. So good I paid add-free version. Only reasons get 5 star because, sometimes (when I'm online) I still get ads. Also there's way go back replay competed levels.","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Downloaded game three weeks ago. I totally love it. Im level 64 already (probably good compared some!) score far 11004. Whomever ever created game...well done. Its relaxing way pass free time. It doesnt kill battery phone either.","sentiment":"POSITIVE"},{"review":"I addicted time. I told myself, I made 1,000,000 points, I would quit playing. I accomplished objective. It fun ride. Nothing seems change game bugs me. I eventually started trying best high scores. Many headaches later, level 1000-something, high score 1,000,000-something, I'm done. It good game. Has anyone else gotten 1,000,000?","sentiment":"POSITIVE"},{"review":"I love zenlike game play. I enjoy challenge albeit light skill level needed anyone age 11yo. What I like best I sit play without much thought zone I need to. Don't waste money buying \"ad free\" version. You still get many ads would using free version, thats complaint.","sentiment":"POSITIVE"},{"review":"DO NOT PAY FOR THIS. I much difficulty trying pay full version. I'm kidding I sat entire day waiting work. When I purchased ad buttons still there, made sounds pressed. I trying find number contact Google tell mad I was. Finally restarting phone fixed it, way I've seen reviews, seems work many people. Therefore, I cannot recommend playing purchasing app. I refund hassle all, I agree reviews answer support email. Everything people say true. Do buy it. UPDATE: seems like I give permissions ask for, continue play ads. It also true ask many permissions. DON'T PLAY THIS! And I definitely ask refund.","sentiment":"POSITIVE"},{"review":"The game good fun. However allowed astronomical amount ads pop ruins fun try force go ad free. The game fun fun enough spend money make ad free. Due extremely large amount ads trying force us buy game, rate 1/5. Otherwise without ads (some ads understand, like every 20 seconds pop up) would gave 3/5","sentiment":"POSITIVE"},{"review":"It goodgame kind addictive. There many ads I know whether phone seems lot lag times? The second chance feature count rather throwing straight back in.","sentiment":"POSITIVE"},{"review":"PAYING TO REMOVE THE ADS DOES NOT WORK! This addicting fun game, issue many ads. As many games I play, I mind spending dollars remove ads... BUT IT DIDN'T REMOVE THE ADS! I still get amount ads, continually banner bottom videos levels. Paying ads nothing. The developer respond, past 48 hours get refund Google. If paying ads actually removed ads, would probably 5 star review!","sentiment":"POSITIVE"},{"review":"Game fun. But many ads! They happen lose go next level. I play 5 minutes. And ads close, wait 10-15 seconds time. And encounter add every 30 seconds (you either lose go level).","sentiment":"POSITIVE"},{"review":"This game would awesome paid $2.49 remove ads, ads actually removed. And what's permissions? Why need access contacts, location, AND phone calls? And still reply dev? Would better would make buttons work. It even restore.","sentiment":"POSITIVE"},{"review":"Great game many ads. I paid $2.49 ad free I still get many before. Tried contacting developer twice last two days response. This seems happening everyone else well. It would easily 5 stars blatantly rob people supporting content. Contacting Google I hear back Voodoo within next days.","sentiment":"POSITIVE"},{"review":"Its unbelievable amount adds. The game pretty fun honestly I could play hours end, fact I constantly assaulted adds. There already static add bottom game play choice watch add get new life fine good, top time fail instantly transported add cant get of. Its ridiculous. I spent time trying get adds game play","sentiment":"POSITIVE"},{"review":"This game bores never-ending ads. If decide buy NO ADS, charge money ads still stay there, multiplied. Their support never responds emails. If going play offline, fun relaxing game kill time. If need stay online... Then better something else.","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"},{"review":"It's bad game. Pretty interesting fun. Graphics might need bit optimization stutters happpens drop much. But ads... reduce little bit. And access data, game like wants location, phone info storage permission? Especially run without fine. Be careful guys...","sentiment":"POSITIVE"},{"review":"Like many people said many times many ads. The gameplay good addictive I decided buy ad free version I still getting ads. I'm sure happening others I contact creators I currently waiting reply.","sentiment":"POSITIVE"},{"review":"This game great except dont like many adds are. I also like dont change up.also second chance sometimes watch says tap restart doesnt even give chance give chance would think would 321 kind thing starts. But still great time passer.","sentiment":"POSITIVE"},{"review":"In honesty I love game. It's nice little game pass time BUT WAY many ads. A good balance would probably levels second chance - there's add every third time lose life. I decided well worth $2.49 eliminate ads - absolutely nothing. My card charged sure enough many ads before.","sentiment":"POSITIVE"},{"review":"Nice game. But soo annoying get highscore press second chance even give you, watch ad still start again. Also could make endless mode levels could challenges. But could also make die level 12 example, instead different every time restart level. Maybe change colours instead repeating actually change difficulty level 5 easy level 65. Soz, giving tips. Amazing game tho. Must get.","sentiment":"NEGATIVE"},{"review":"Great game. Highly recommended. Had similar game sameness level color game headache. The different level colors nice, although repeat, better colors every level. Each level takes day more, might me, repeating colors bother me. I friend plays game 24/7 loves level 300+! Definitely must get.","sentiment":"POSITIVE"},{"review":"Paid advertisements, yet I still get consistent advertisements almost every time I restart (and occasionally ads bottom screen). And I aware using extra life plays video regardless whether I paid ads, that's I mean. I paid ads, yet I still ads. The game still pretty fun though. But yeah dont waste money trying remove ads.","sentiment":"POSITIVE"},{"review":"Half half opinions. For reason whenever I beat high score, 34,000 something, says Helix Jump stopped working. I got 38,546 I passed level 97 I got ad, exited Helix Jump. It happened already 2 times I know why. But game SUPER ADDICTING I love playing. Maybe big glitch I hope creators game could fix...","sentiment":"NEGATIVE"},{"review":"I love game. Its different anything there. Addictive. Easy&Hard time. The bigger screen easier becomes. Ads shows 3 rounds. Ads problem all. As long go back button phone skip almost Ads 5 seconds. I recommend game everyone. Current level 38!","sentiment":"NEGATIVE"},{"review":"nan","sentiment":"-"},{"review":"This game really laggy remade nicely. Also adds non stop like every time pass level. Other wise game really good. It's really entertaining fun play. Also remake copy 1001 games game looks like game also I see front I saw Voodoo h8games please explain.","sentiment":"POSITIVE"},{"review":"This game favourite game ever still lot work on. I never play game I'm connected Internet game lags. Ads every time die pass level much. But game still kinda new I'm going give time. Keep good work!! I would also like say I update game I phone users I I'm samsung?","sentiment":"NEGATIVE"},{"review":"The game great addicting. Seems trending fun play. The game looks easy quite challenging. Also, everybody class phone loves game always plays game lol. Also, ads go malicious constantly reopen. My antivirus says blocked while. Please fix this.","sentiment":"POSITIVE"},{"review":"Well fun long time started getting really high levels. Say level 700, give 700 points made six digits. It count 100. Then eventually made level 900, even go six digits. After hit 99,999 resets back 10,000. Really thinking deleting knowing I can't break score 6 digits.","sentiment":"POSITIVE"},{"review":"The game enjoyable enough I paid ads removed I still ads despite charged fee remove them. I've sent email VooDoo received response two days. Would rate 5 stars feel like stole money. Edit: Day 11 still ads!","sentiment":"POSITIVE"},{"review":"Let tell I'm much gamer I heard Helix jump game Store I decide get cuz looked interesting little I know I would fall love game almost immediately. This game addicting much fun play awesome time-killer, great graphics, overall awesome gamer, I really suggest get give shot disappointed I hope developer continues make lovely awesome games keep games coming man.","sentiment":"POSITIVE"},{"review":"This voodoo guy scammer. This second game I pay ads still there. How expect give good review can't figure implement premium paid version. You sure know stick ads everywhere though.","sentiment":"POSITIVE"},{"review":"The best minimalistic Game ever.. I play forever. Just right amount difficulty satisfyingly so.Never gonna delete game! On side note Dear developer, bugs time time please fix soon. Great job!","sentiment":"POSITIVE"},{"review":"For reason I payed ads. I close game come back in. WHAT DO I SEE? AN AD AT THE BOTTOM OF MY GAME. I PAYED GOOD MONEY TO ENJOY THIS GAME BUT WHOEVER THE PLEBS ARE THAT MADE THIS GAME DECIDED TO GIVE ME AN AD. #STOPTHEADABUSE","sentiment":"NEGATIVE"},{"review":"I gave star I love game I can't play phone. Every time I press say little box \" unfortunately helix jump stopped\" takes home screen. It addicting can't even get Samsung.","sentiment":"NEGATIVE"},{"review":"The game awesome, I giving 2 stars enormous amount adds get! It intense game freezes trying load adds. I show middle game play. I understand free version expensive adds free version, can't many adds,it's madness. I checked much data take I'm pretty sure drains lot plan.","sentiment":"POSITIVE"},{"review":"Honestly I would given game 5 star review, I really enjoy love playing it. Unfortunately though, I got sick ads PAID \"no ads\". Well... money taken I still getting ads every level. Tried contact developers fix this, responded email.","sentiment":"NEGATIVE"},{"review":"Actually enjoyable game, however I paid ad-free gameplay still get ads. I've emailed multiple times developers via support email listed got response. However, I realised turn internet connection, ads displayed anyway, I recommend everyone turns internet connection play game, DOES NOT pay ad-free upgrade. This company robbing people.","sentiment":"NEGATIVE"},{"review":"Love game great fun addictive. It's good I paid 2.49 get rid adverts there's problem pay still get adverts.update: After emails developer This poor review dont bother reply either. Have reported scam Google hopefully remove adverts paid too.","sentiment":"POSITIVE"},{"review":"The game good. It's addicting fun play spare time however variation levels played couple levels begins get repetitive. I first downloaded game phone worked well although far many ads particularly considering often long. I attempted tablet however, first even finally even work! Slightly disappointed but, overall actual game fun works.","sentiment":"POSITIVE"},{"review":"This game terrible 1. If go different platform 50% death spot beneath 2.dont even think going super fast mode go 3 platforms there's pretty much 75% death spot 3. All God dam adds God dam every pretty much die three times.","sentiment":"POSITIVE"},{"review":"I really enjoy game great time killer. The reason I rate low I paid ads I still get them. Every 3 times I restart I get ad. I also noticed others issue reply devs. Please give us paid I gladly rate 5 stars.","sentiment":"POSITIVE"},{"review":"Helix Jump great game. You may get lots ads long gameplay hard levels best played long road trip opinion. It's overall great game! Some physics graphics game could changed enhance gameplay. I look forward new changes VOODOO adding soon, I encourage VOODOO continue work game! I've made way level 350 amount time I play it. It currently favorite game. (If say many ads helpful. Just play wifi data.. turn airplane mode. This remove ads)","sentiment":"POSITIVE"},{"review":"This okay, gameplay get laggy sometimes awful. The amount ads game criminal. They give 30 second every single time die. I turn wifi data play normally amount ads affects gameplay.","sentiment":"NEGATIVE"},{"review":"Well, sensitivity option would good, seriously AD every time die ? Theres also banner doesn't let's play since ad playing. The option turn wifi. Also I'm experiencing lags get 3 stairs once.","sentiment":"POSITIVE"},{"review":"Very fun game, it'll keep busy. The reason I low scoring ad-free version costs money, still shows ads. Another downside reaching support, reply. I've waiting week hear them. Don't buy ad-free version wasting money. If used ad supported games means. To honest, borderline many ads ad supported game.","sentiment":"POSITIVE"},{"review":"Can tell game would need access photos, location, need mange phone calls? I've played game good bit now. The ad bottom screen tolerable. But I need see 30 second ad every 3 games? Uninstalled.","sentiment":"NEGATIVE"},{"review":"Excellent game satisfying physics easy learn hard master premise. Way many ads, though. An ad gain life fine, showing ad regardless I 'choose' much choice, it?","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"I liked lot I paid remove ads surprise! You can't second chances anymore all. Otherwise, simple addictive. Just buy ads option -- ripoff since makes \"pay lose\" anything.","sentiment":"POSITIVE"},{"review":"I saw played game friend's phone good. ..but I tried open game stopped working. ...I think compatible version -Jelly Bean- Or phone cannot run -Samsung galaxy grand- Please fix this........BUT THE GAME IS AWESOME. !!!!!!.....","sentiment":"POSITIVE"},{"review":"Definitely giving 3 stars. It's OK. WAY many adds! Makes want play it. I agree fun challenging right want play ads keep coming. I'll probably play little uninstall phone. Not dealing ads.","sentiment":"POSITIVE"},{"review":"I got game kids I loved it. But hated constant ads. So I paid game ad-free still ads. I sent message creator asking please fix refund money. Hours later response game laggy I can't even play!!! Shame u VOODOO!! I liked game. Now I'm deleting it.","sentiment":"NEGATIVE"},{"review":"This game soooo full ads thats impossible play it. In game like die 2000 times get ad every second death. This problem voodoo apps, make hard put much ads it. isnt bad ffs lover ad level","sentiment":"NEGATIVE"},{"review":"Actually really enjoy playing game, however I paid upgraded version without ads still continued get ads. Emailed developer week ago along attached confirmation purchase never got response, therefore I'm giving star. Just a... Full Review","sentiment":"POSITIVE"},{"review":"Update: I finally bought premium version avoid ads I'm still getting ads non stop despite reaching devs responded all. Going request refund I guess. Original review: The game fun addicting, many ads. An ad every time restart level, ad beat level, ad blink many times. I know devs make money game free pretty top","sentiment":"POSITIVE"},{"review":"Hi VOODOO I issues game I press icon everytime I try go game tablet says 'unfortunately helix jump stopped'. I honestly know game made IOS'S Android. I rated five stars u played friends iPhone really good quality. But seemed work perfectly phone tablet. can, reply comment inform happening. Thank","sentiment":"POSITIVE"},{"review":"It's good game much need update. There ads die get next level. When I first started play I went straight game. When game front screen thing. Also I got level 4 phones screen went black screen come back. It's good game lot work. Keep good work!","sentiment":"POSITIVE"},{"review":"I love game seems like thing again. It get harder easier. They even change colors repeat them. It's like loop level say different level. Please make challenging get higher game change maybe different color level. Other wise cool I beat like 6 levels 1 hour!","sentiment":"POSITIVE"},{"review":"Love game - really addictive, could added difficulty levels pass by. My kid plays lot too, I thought \"let's buy full version help developers\". HOWEVER, I paid NO ADDS version, BUT NOTHING CHANGED, adds continue pop usual. Because gets 2 starts :(","sentiment":"NEGATIVE"},{"review":"Ok I enjoying game, fun super addictive. The reason lost star review I keep getting ads middle level, makes lose. I mind ads levels skip 5 seconds cannot deal ads affecting gameplay ruining score.","sentiment":"POSITIVE"},{"review":"I've enjoyed game, giving poor review someone addresses issue. I paid ads removed almost month ago still receiving numerous ads. I've emailed development team Google play store, received response. If nothing changes I'll delete game together leave review permanently","sentiment":"NEGATIVE"},{"review":"Easy good. By way, I've noticed saying score hits 6 digits resets 10000. This true, might noticed points lower time, score still 100k+, fill screen up. E.g. I got score 300k, would say 30000. Hope helps people!","sentiment":"POSITIVE"},{"review":"This game opinion simple fun addicting time . However variety colors \"trap\" positions limited kin getting boring. There also large amount ads even paying remove . And completely honest, I noticed level easiness canged much AT ALL past atleast 30 levels I've played. There define try change otherwise get attention.","sentiment":"NEGATIVE"},{"review":"Like others I bought ad free version continued receiving ads. Then, I contacted devs response. I tried uninstalling reinstalling app, wondering would fix started way back level 1. So, even though clearly communicating Google Play (taking money problem), saving progress. Done filing refund.","sentiment":"POSITIVE"},{"review":"The game play good. My issue even though paid money ad free version, still getting ads hell lot ads gameplay. This clear con. Developers, please either remove option go ad free update support this. I dropped email support team refund response far. please look this. otherwise great simple game. Loved it.","sentiment":"POSITIVE"},{"review":"I really enjoy game. It's great time killer, challenging enough fun. My complaint viewing ad 'second chance', drops right back game, immediately ad closes. It makes 'second chance' kind pointless. I feel brief countdown -- '3, 2, 1' sort thing -- order allow player prepare would improve feature greatly.","sentiment":"POSITIVE"},{"review":"Way many ads liking. This really good fun game, lose about, 3 rounds, gives ad. And ad sit like five seconds wait over, likely going long ad. Please decrease ads pop expect lot people delete game phone. I read reviews I downloaded game I delete endless amount ads drains phone.","sentiment":"POSITIVE"},{"review":"The ads bug me. When pops I close open again. Takes like 2 seconds. But trying get high score cant close lose score. I think colors better backgrounds would make game exciting playing.","sentiment":"POSITIVE"},{"review":"This definitely simple yet addictive games I've ever played. Only catch, I paid remove ads yet I still get them. What gives? And said: no, I mean \"second chance\" button fail. Also, ad bottom screen still I play.","sentiment":"NEGATIVE"},{"review":"The second chance needs countdown start I've many times starts without warning kills instantly. Plus I think need arrow either side screen rotate with. I keep falling multiple floors time I find thumb keeps getting way. Would nicer arrow bottom corners clear play area.","sentiment":"POSITIVE"},{"review":"Ok, I love game, much fun I play hours straight. But waayyyy many ads. like every 3 games there's another ad there's ads bottom screen. I'm going pay ads cuz I feel like waste money time many ads game! I understand ads great way display product people show many ads makes want delete app. I mind ad every ten games so. In addition, I think ads bottom screen get way game. Love game though, fix ads.","sentiment":"POSITIVE"},{"review":"It started great ads tolerable. Lately (on level 30+), I cannot go level without trying open Chrome tab advert (constantly!). This I die, new level, I jumping pass around 30%, it'll randomly open advert phone, even I follow till final pop up, soon I return game, open new one.","sentiment":"POSITIVE"},{"review":"Game fun addicting, receiving low score many ads. I purchased premium No Ads option nothing changed. I charged purchase, despite trying contact developers 3 times last month I received response. No Ads option SCAM! Please take Ads away give refund!!!","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Not bad game start with, I fun competing half unfortunately latest update killed it. Levels became shorter easier meaning I sailed level 40 level 200 rapidly. Ads bearing. Complete level, get two ads. Lose life, another two ads. Half way turn, another ad...","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"I actually really enjoy game, I agree ads waaaaay many much. But I like game much I willing pay higher-than-average cost ad-free. However, I paid remove ads I still ads. The charge went card, I \"no ads\" button again, anything. And yet.. still ads. I revise review 5 stars ads removed like be.","sentiment":"POSITIVE"},{"review":"I Would've loved give game better review, Ads Non stop ruin game expierance completely. If I skip second chance ad gives another Ad immediately I start level without reward it, add fact Ads 30 seconds unskippable. Like said, would've loved give higher rating, Ads make unbearable.","sentiment":"POSITIVE"},{"review":"Simple, fun, addictive asks well made game. So good I paid add-free version. Only reasons get 5 star because, sometimes (when I'm online) I still get ads. Also there's way go back replay competed levels.","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Downloaded game three weeks ago. I totally love it. Im level 64 already (probably good compared some!) score far 11004. Whomever ever created game...well done. Its relaxing way pass free time. It doesnt kill battery phone either.","sentiment":"POSITIVE"},{"review":"I addicted time. I told myself, I made 1,000,000 points, I would quit playing. I accomplished objective. It fun ride. Nothing seems change game bugs me. I eventually started trying best high scores. Many headaches later, level 1000-something, high score 1,000,000-something, I'm done. It good game. Has anyone else gotten 1,000,000?","sentiment":"POSITIVE"},{"review":"I love zenlike game play. I enjoy challenge albeit light skill level needed anyone age 11yo. What I like best I sit play without much thought zone I need to. Don't waste money buying \"ad free\" version. You still get many ads would using free version, thats complaint.","sentiment":"POSITIVE"},{"review":"DO NOT PAY FOR THIS. I much difficulty trying pay full version. I'm kidding I sat entire day waiting work. When I purchased ad buttons still there, made sounds pressed. I trying find number contact Google tell mad I was. Finally restarting phone fixed it, way I've seen reviews, seems work many people. Therefore, I cannot recommend playing purchasing app. I refund hassle all, I agree reviews answer support email. Everything people say true. Do buy it. UPDATE: seems like I give permissions ask for, continue play ads. It also true ask many permissions. DON'T PLAY THIS! And I definitely ask refund.","sentiment":"POSITIVE"},{"review":"The game good fun. However allowed astronomical amount ads pop ruins fun try force go ad free. The game fun fun enough spend money make ad free. Due extremely large amount ads trying force us buy game, rate 1/5. Otherwise without ads (some ads understand, like every 20 seconds pop up) would gave 3/5","sentiment":"POSITIVE"},{"review":"It goodgame kind addictive. There many ads I know whether phone seems lot lag times? The second chance feature count rather throwing straight back in.","sentiment":"POSITIVE"},{"review":"PAYING TO REMOVE THE ADS DOES NOT WORK! This addicting fun game, issue many ads. As many games I play, I mind spending dollars remove ads... BUT IT DIDN'T REMOVE THE ADS! I still get amount ads, continually banner bottom videos levels. Paying ads nothing. The developer respond, past 48 hours get refund Google. If paying ads actually removed ads, would probably 5 star review!","sentiment":"POSITIVE"},{"review":"Game fun. But many ads! They happen lose go next level. I play 5 minutes. And ads close, wait 10-15 seconds time. And encounter add every 30 seconds (you either lose go level).","sentiment":"POSITIVE"},{"review":"This game would awesome paid $2.49 remove ads, ads actually removed. And what's permissions? Why need access contacts, location, AND phone calls? And still reply dev? Would better would make buttons work. It even restore.","sentiment":"POSITIVE"},{"review":"Great game many ads. I paid $2.49 ad free I still get many before. Tried contacting developer twice last two days response. This seems happening everyone else well. It would easily 5 stars blatantly rob people supporting content. Contacting Google I hear back Voodoo within next days.","sentiment":"POSITIVE"},{"review":"Its unbelievable amount adds. The game pretty fun honestly I could play hours end, fact I constantly assaulted adds. There already static add bottom game play choice watch add get new life fine good, top time fail instantly transported add cant get of. Its ridiculous. I spent time trying get adds game play","sentiment":"POSITIVE"},{"review":"This game bores never-ending ads. If decide buy NO ADS, charge money ads still stay there, multiplied. Their support never responds emails. If going play offline, fun relaxing game kill time. If need stay online... Then better something else.","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"},{"review":"It's bad game. Pretty interesting fun. Graphics might need bit optimization stutters happpens drop much. But ads... reduce little bit. And access data, game like wants location, phone info storage permission? Especially run without fine. Be careful guys...","sentiment":"POSITIVE"},{"review":"Like many people said many times many ads. The gameplay good addictive I decided buy ad free version I still getting ads. I'm sure happening others I contact creators I currently waiting reply.","sentiment":"POSITIVE"},{"review":"This game great except dont like many adds are. I also like dont change up.also second chance sometimes watch says tap restart doesnt even give chance give chance would think would 321 kind thing starts. But still great time passer.","sentiment":"POSITIVE"},{"review":"In honesty I love game. It's nice little game pass time BUT WAY many ads. A good balance would probably levels second chance - there's add every third time lose life. I decided well worth $2.49 eliminate ads - absolutely nothing. My card charged sure enough many ads before.","sentiment":"POSITIVE"},{"review":"Nice game. But soo annoying get highscore press second chance even give you, watch ad still start again. Also could make endless mode levels could challenges. But could also make die level 12 example, instead different every time restart level. Maybe change colours instead repeating actually change difficulty level 5 easy level 65. Soz, giving tips. Amazing game tho. Must get.","sentiment":"NEGATIVE"},{"review":"Great game. Highly recommended. Had similar game sameness level color game headache. The different level colors nice, although repeat, better colors every level. Each level takes day more, might me, repeating colors bother me. I friend plays game 24/7 loves level 300+! Definitely must get.","sentiment":"POSITIVE"},{"review":"Paid advertisements, yet I still get consistent advertisements almost every time I restart (and occasionally ads bottom screen). And I aware using extra life plays video regardless whether I paid ads, that's I mean. I paid ads, yet I still ads. The game still pretty fun though. But yeah dont waste money trying remove ads.","sentiment":"POSITIVE"},{"review":"Half half opinions. For reason whenever I beat high score, 34,000 something, says Helix Jump stopped working. I got 38,546 I passed level 97 I got ad, exited Helix Jump. It happened already 2 times I know why. But game SUPER ADDICTING I love playing. Maybe big glitch I hope creators game could fix...","sentiment":"NEGATIVE"},{"review":"I love game. Its different anything there. Addictive. Easy&Hard time. The bigger screen easier becomes. Ads shows 3 rounds. Ads problem all. As long go back button phone skip almost Ads 5 seconds. I recommend game everyone. Current level 38!","sentiment":"NEGATIVE"},{"review":"nan","sentiment":"-"},{"review":"This game really laggy remade nicely. Also adds non stop like every time pass level. Other wise game really good. It's really entertaining fun play. Also remake copy 1001 games game looks like game also I see front I saw Voodoo h8games please explain.","sentiment":"POSITIVE"},{"review":"This game favourite game ever still lot work on. I never play game I'm connected Internet game lags. Ads every time die pass level much. But game still kinda new I'm going give time. Keep good work!! I would also like say I update game I phone users I I'm samsung?","sentiment":"NEGATIVE"},{"review":"The game great addicting. Seems trending fun play. The game looks easy quite challenging. Also, everybody class phone loves game always plays game lol. Also, ads go malicious constantly reopen. My antivirus says blocked while. Please fix this.","sentiment":"POSITIVE"},{"review":"Well fun long time started getting really high levels. Say level 700, give 700 points made six digits. It count 100. Then eventually made level 900, even go six digits. After hit 99,999 resets back 10,000. Really thinking deleting knowing I can't break score 6 digits.","sentiment":"POSITIVE"},{"review":"The game enjoyable enough I paid ads removed I still ads despite charged fee remove them. I've sent email VooDoo received response two days. Would rate 5 stars feel like stole money. Edit: Day 11 still ads!","sentiment":"POSITIVE"},{"review":"Let tell I'm much gamer I heard Helix jump game Store I decide get cuz looked interesting little I know I would fall love game almost immediately. This game addicting much fun play awesome time-killer, great graphics, overall awesome gamer, I really suggest get give shot disappointed I hope developer continues make lovely awesome games keep games coming man.","sentiment":"POSITIVE"},{"review":"This voodoo guy scammer. This second game I pay ads still there. How expect give good review can't figure implement premium paid version. You sure know stick ads everywhere though.","sentiment":"POSITIVE"},{"review":"The best minimalistic Game ever.. I play forever. Just right amount difficulty satisfyingly so.Never gonna delete game! On side note Dear developer, bugs time time please fix soon. Great job!","sentiment":"POSITIVE"},{"review":"For reason I payed ads. I close game come back in. WHAT DO I SEE? AN AD AT THE BOTTOM OF MY GAME. I PAYED GOOD MONEY TO ENJOY THIS GAME BUT WHOEVER THE PLEBS ARE THAT MADE THIS GAME DECIDED TO GIVE ME AN AD. #STOPTHEADABUSE","sentiment":"NEGATIVE"},{"review":"I gave star I love game I can't play phone. Every time I press say little box \" unfortunately helix jump stopped\" takes home screen. It addicting can't even get Samsung.","sentiment":"NEGATIVE"},{"review":"The game awesome, I giving 2 stars enormous amount adds get! It intense game freezes trying load adds. I show middle game play. I understand free version expensive adds free version, can't many adds,it's madness. I checked much data take I'm pretty sure drains lot plan.","sentiment":"POSITIVE"},{"review":"Honestly I would given game 5 star review, I really enjoy love playing it. Unfortunately though, I got sick ads PAID \"no ads\". Well... money taken I still getting ads every level. Tried contact developers fix this, responded email.","sentiment":"NEGATIVE"},{"review":"Actually enjoyable game, however I paid ad-free gameplay still get ads. I've emailed multiple times developers via support email listed got response. However, I realised turn internet connection, ads displayed anyway, I recommend everyone turns internet connection play game, DOES NOT pay ad-free upgrade. This company robbing people.","sentiment":"NEGATIVE"},{"review":"Love game great fun addictive. It's good I paid 2.49 get rid adverts there's problem pay still get adverts.update: After emails developer This poor review dont bother reply either. Have reported scam Google hopefully remove adverts paid too.","sentiment":"POSITIVE"},{"review":"The game good. It's addicting fun play spare time however variation levels played couple levels begins get repetitive. I first downloaded game phone worked well although far many ads particularly considering often long. I attempted tablet however, first even finally even work! Slightly disappointed but, overall actual game fun works.","sentiment":"POSITIVE"},{"review":"This game terrible 1. If go different platform 50% death spot beneath 2.dont even think going super fast mode go 3 platforms there's pretty much 75% death spot 3. All God dam adds God dam every pretty much die three times.","sentiment":"POSITIVE"},{"review":"I really enjoy game great time killer. The reason I rate low I paid ads I still get them. Every 3 times I restart I get ad. I also noticed others issue reply devs. Please give us paid I gladly rate 5 stars.","sentiment":"POSITIVE"},{"review":"Helix Jump great game. You may get lots ads long gameplay hard levels best played long road trip opinion. It's overall great game! Some physics graphics game could changed enhance gameplay. I look forward new changes VOODOO adding soon, I encourage VOODOO continue work game! I've made way level 350 amount time I play it. It currently favorite game. (If say many ads helpful. Just play wifi data.. turn airplane mode. This remove ads)","sentiment":"POSITIVE"},{"review":"This okay, gameplay get laggy sometimes awful. The amount ads game criminal. They give 30 second every single time die. I turn wifi data play normally amount ads affects gameplay.","sentiment":"NEGATIVE"},{"review":"Well, sensitivity option would good, seriously AD every time die ? Theres also banner doesn't let's play since ad playing. The option turn wifi. Also I'm experiencing lags get 3 stairs once.","sentiment":"POSITIVE"},{"review":"Very fun game, it'll keep busy. The reason I low scoring ad-free version costs money, still shows ads. Another downside reaching support, reply. I've waiting week hear them. Don't buy ad-free version wasting money. If used ad supported games means. To honest, borderline many ads ad supported game.","sentiment":"POSITIVE"},{"review":"Can tell game would need access photos, location, need mange phone calls? I've played game good bit now. The ad bottom screen tolerable. But I need see 30 second ad every 3 games? Uninstalled.","sentiment":"NEGATIVE"},{"review":"Excellent game satisfying physics easy learn hard master premise. Way many ads, though. An ad gain life fine, showing ad regardless I 'choose' much choice, it?","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"I liked lot I paid remove ads surprise! You can't second chances anymore all. Otherwise, simple addictive. Just buy ads option -- ripoff since makes \"pay lose\" anything.","sentiment":"POSITIVE"},{"review":"I saw played game friend's phone good. ..but I tried open game stopped working. ...I think compatible version -Jelly Bean- Or phone cannot run -Samsung galaxy grand- Please fix this........BUT THE GAME IS AWESOME. !!!!!!.....","sentiment":"POSITIVE"},{"review":"Definitely giving 3 stars. It's OK. WAY many adds! Makes want play it. I agree fun challenging right want play ads keep coming. I'll probably play little uninstall phone. Not dealing ads.","sentiment":"POSITIVE"},{"review":"I got game kids I loved it. But hated constant ads. So I paid game ad-free still ads. I sent message creator asking please fix refund money. Hours later response game laggy I can't even play!!! Shame u VOODOO!! I liked game. Now I'm deleting it.","sentiment":"NEGATIVE"},{"review":"This game soooo full ads thats impossible play it. In game like die 2000 times get ad every second death. This problem voodoo apps, make hard put much ads it. isnt bad ffs lover ad level","sentiment":"NEGATIVE"},{"review":"Bought No Ads version, ads still there. Restarted buying No Ads version, ads still there. Is I denied overreaching permissions? There absolutely reason whatsoever would need ANY 3 permissions -- photos, GPS location especially NOT phone call making! Great game, addicting, needs lot work still, removal unnecessary permissions.","sentiment":"POSITIVE"},{"review":"This game really fun adictive! Do favour INTALL THIS GAME! But small tip makers app, colour choices would great improvment. And little complaint: got around levle forty tapped 'watch add try again' thing watched add would save progress would start levle again. But encountered eror would definitely given five stars!","sentiment":"NEGATIVE"},{"review":"I understand need adverts make money I mind adverts every 10 seconds means I can't actually play game see I like enough buy full version. Very frustrating. Played mins annoying deleting now.","sentiment":"NEGATIVE"},{"review":"Okay guys. I understand everybody needs earn share somehow. But charge ads game I pay, means supply version ads anymore. Not delivering contract linked payment top work out.","sentiment":"POSITIVE"},{"review":"This game fun good. My problem I paid ad free version still get ads. I reached developer 4 times regarding received response, terrible customer service. DO NOT BUY THE AD FREE ENHANCEMENT","sentiment":"POSITIVE"},{"review":"I bought ads game (2.49 usd isnt much I go point) still get video ads pop up. I'm talking ones bottom screen ones cover whole screen play. please fix this. scam please refund purchase I report you. (proof youtube channel Camel Cam","sentiment":"NEUTRAL"},{"review":"I bought full version watch 15 30 second adds every time passed level died. Still watch adds wait sometimes add. DONT BUY THE FULL VERSION. Im dissapointed never pay games. You guys suck......","sentiment":"POSITIVE"},{"review":"This game really addictive really fun plz add new things challenging? Because levels thing think u guys make new stuff instead thing level.. oh colors too, u add new colors please.. thank","sentiment":"POSITIVE"},{"review":"I really like game things I like I level 144 levels get harder! The 2 things I dislike game takes long open glitches much lately I keep dying!!! Other I problems highly recommend this!!! Please fix problems asap","sentiment":"NEGATIVE"},{"review":"nan","sentiment":"-"},{"review":"This cute, little game helps kill time. My go-to boredom hits pretty much. It also challenging, keeps interesting. I find playing lot. (almost much haha) Anyway, reason I gave four stars amount ads! There many ads, usually strait 45 seconds long. I'd also like know needs access photos?? Overall, great app.","sentiment":"POSITIVE"},{"review":"Loved game I clicked \"No Ads\" paid $2.49 ads still get also I can't anymore money gone I seriously hate ads. Damn near everytime get done ads! Don't waste money","sentiment":"NEGATIVE"},{"review":"Like others said, paid remove ads, still getting amount ads. No option refund, like paid do. The No Ads version scam, needs addressed Google game developer. Developer built many ads becomes unplayable, thus driving people pay ads, still getting ads. BEWARE.","sentiment":"NEGATIVE"},{"review":"DON'T PAY FOR \"NO ADS!\" The ads still pop up. Just little less often. I enjoyed game, ads every time die? Way much! And paying \"no ads\" make go away, (still shows image ads even 30 second interactive type ads).","sentiment":"NEGATIVE"},{"review":"Good, fun game. However, paid fee ads, still get ads. I've billed/charged already still nothing. I tried troubleshooting Google play has, well contacted Google refund. I told need contact game developer (Voodoo) directly. Have reached Voodoo reply. This SECOND Voodoo game issue with.","sentiment":"NEGATIVE"},{"review":"I would rate game higher, I bought ads free version still get tons ads, total ripoff! The game fun, way sign save switch phones progress lost. :(","sentiment":"NEGATIVE"},{"review":"Game kinds fun hell would put ad every play? And ads require several seconds two exit buttons get by. I can't think without seeing ad. Guys concerned ads experience.","sentiment":"NEGATIVE"},{"review":"Don't even waste time. I got level 101 see anything new would happen. But lousy game level 5 up. Same color schemes random predictable boards. Glad I pay remove ads game probably never get update.","sentiment":"NEGATIVE"},{"review":"I enjoy game. Too bad I paid ads option still receive constant pop ads videos. I emailed response either. I'm considering taking legal action nothing happens soon. I want problem fixed I want money back. False advertising serious issue.","sentiment":"NEGATIVE"},{"review":"This game addicting. I started playing since like 10 morning right I'm level 12. It's fun. Although I want ball different shape. Like whenever pass level get different shaped ball. And change color shape whenever want. Oh medal award teach level 60 something","sentiment":"POSITIVE"},{"review":"Actually really enjoy playing game, however I paid upgraded version without ads still continued get ads. Emailed developer week ago along attached confirmation purchase never got response, therefore I'm giving star. Just lot downloads mean overlook people support game; especially ones voluntarily pay upgraded version.","sentiment":"NEGATIVE"},{"review":"Update: I finally bought premium version avoid ads I'm still getting ads non stop despite reaching devs responded all. Going request refund I guess. Original review: The game fun addicting, many ads. An ad every time restart level, ad beat level, ad blink many times. I know devs make money game free pretty top","sentiment":"POSITIVE"},{"review":"Hi VOODOO I issues game I press icon everytime I try go game tablet says 'unfortunately helix jump stopped'. I honestly know game made IOS'S Android. I rated five stars u played friends iPhone really good quality. But seemed work perfectly phone tablet. can, reply comment inform happening. Thank","sentiment":"POSITIVE"},{"review":"It's good game much need update. There ads die get next level. When I first started play I went straight game. When game front screen thing. Also I got level 4 phones screen went black screen come back. It's good game lot work. Keep good work!","sentiment":"POSITIVE"},{"review":"I love game seems like thing again. It get harder easier. They even change colors repeat them. It's like loop level say different level. Please make challenging get higher game change maybe different color level. Other wise cool I beat like 6 levels 1 hour!","sentiment":"POSITIVE"},{"review":"Love game - really addictive, could added difficulty levels pass by. My kid plays lot too, I thought \"let's buy full version help developers\". HOWEVER, I paid NO ADDS version, BUT NOTHING CHANGED, adds continue pop usual. Because gets 2 starts :(","sentiment":"NEGATIVE"},{"review":"Ok I enjoying game, fun super addictive. The reason lost star review I keep getting ads middle level, makes lose. I mind ads levels skip 5 seconds cannot deal ads affecting gameplay ruining score.","sentiment":"POSITIVE"},{"review":"I've enjoyed game, giving poor review someone addresses issue. I paid ads removed almost month ago still receiving numerous ads. I've emailed development team Google play store, received response. If nothing changes I'll delete game together leave review permanently","sentiment":"NEGATIVE"},{"review":"Easy good. By way, I've noticed saying score hits 6 digits resets 10000. This true, might noticed points lower time, score still 100k+, fill screen up. E.g. I got score 300k, would say 30000. Hope helps people!","sentiment":"POSITIVE"},{"review":"This game opinion simple fun addicting time . However variety colors \"trap\" positions limited kin getting boring. There also large amount ads even paying remove . And completely honest, I noticed level easiness canged much AT ALL past atleast 30 levels I've played. There define try change otherwise get attention.","sentiment":"NEGATIVE"},{"review":"Like others I bought ad free version continued receiving ads. Then, I contacted devs response. I tried uninstalling reinstalling app, wondering would fix started way back level 1. So, even though clearly communicating Google Play (taking money problem), saving progress. Done filing refund.","sentiment":"POSITIVE"},{"review":"The game play good. My issue even though paid money ad free version, still getting ads hell lot ads gameplay. This clear con. Developers, please either remove option go ad free update support this. I dropped email support team refund response far. please look this. otherwise great simple game. Loved it.","sentiment":"POSITIVE"},{"review":"I really enjoy game. It's great time killer, challenging enough fun. My complaint viewing ad 'second chance', drops right back game, immediately ad closes. It makes 'second chance' kind pointless. I feel brief countdown -- '3, 2, 1' sort thing -- order allow player prepare would improve feature greatly.","sentiment":"POSITIVE"},{"review":"Way many ads liking. This really good fun game, lose about, 3 rounds, gives ad. And ad sit like five seconds wait over, likely going long ad. Please decrease ads pop expect lot people delete game phone. I read reviews I downloaded game I delete endless amount ads drains phone.","sentiment":"POSITIVE"},{"review":"The ads bug me. When pops I close open again. Takes like 2 seconds. But trying get high score cant close lose score. I think colors better backgrounds would make game exciting playing.","sentiment":"POSITIVE"},{"review":"This definitely simple yet addictive games I've ever played. Only catch, I paid remove ads yet I still get them. What gives? And said: no, I mean \"second chance\" button fail. Also, ad bottom screen still I play.","sentiment":"NEGATIVE"},{"review":"The second chance needs countdown start I've many times starts without warning kills instantly. Plus I think need arrow either side screen rotate with. I keep falling multiple floors time I find thumb keeps getting way. Would nicer arrow bottom corners clear play area.","sentiment":"POSITIVE"},{"review":"Ok, I love game, much fun I play hours straight. But waayyyy many ads. like every 3 games there's another ad there's ads bottom screen. I'm going pay ads cuz I feel like waste money time many ads game! I understand ads great way display product people show many ads makes want delete app. I mind ad every ten games so. In addition, I think ads bottom screen get way game. Love game though, fix ads.","sentiment":"POSITIVE"},{"review":"It started great ads tolerable. Lately (on level 30+), I cannot go level without trying open Chrome tab advert (constantly!). This I die, new level, I jumping pass around 30%, it'll randomly open advert phone, even I follow till final pop up, soon I return game, open new one.","sentiment":"POSITIVE"},{"review":"Game fun addicting, receiving low score many ads. I purchased premium No Ads option nothing changed. I charged purchase, despite trying contact developers 3 times last month I received response. No Ads option SCAM! Please take Ads away give refund!!!","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Not bad game start with, I fun competing half unfortunately latest update killed it. Levels became shorter easier meaning I sailed level 40 level 200 rapidly. Ads bearing. Complete level, get two ads. Lose life, another two ads. Half way turn, another ad...","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"I actually really enjoy game, I agree ads waaaaay many much. But I like game much I willing pay higher-than-average cost ad-free. However, I paid remove ads I still ads. The charge went card, I \"no ads\" button again, anything. And yet.. still ads. I revise review 5 stars ads removed like be.","sentiment":"POSITIVE"},{"review":"I Would've loved give game better review, Ads Non stop ruin game expierance completely. If I skip second chance ad gives another Ad immediately I start level without reward it, add fact Ads 30 seconds unskippable. Like said, would've loved give higher rating, Ads make unbearable.","sentiment":"POSITIVE"},{"review":"Simple, fun, addictive asks well made game. So good I paid add-free version. Only reasons get 5 star because, sometimes (when I'm online) I still get ads. Also there's way go back replay competed levels.","sentiment":"POSITIVE"},{"review":"nan","sentiment":"-"},{"review":"Downloaded game three weeks ago. I totally love it. Im level 64 already (probably good compared some!) score far 11004. Whomever ever created game...well done. Its relaxing way pass free time. It doesnt kill battery phone either.","sentiment":"POSITIVE"},{"review":"I addicted time. I told myself, I made 1,000,000 points, I would quit playing. I accomplished objective. It fun ride. Nothing seems change game bugs me. I eventually started trying best high scores. Many headaches later, level 1000-something, high score 1,000,000-something, I'm done. It good game. Has anyone else gotten 1,000,000?","sentiment":"POSITIVE"},{"review":"I love zenlike game play. I enjoy challenge albeit light skill level needed anyone age 11yo. What I like best I sit play without much thought zone I need to. Don't waste money buying \"ad free\" version. You still get many ads would using free version, thats complaint.","sentiment":"POSITIVE"},{"review":"DO NOT PAY FOR THIS. I much difficulty trying pay full version. I'm kidding I sat entire day waiting work. When I purchased ad buttons still there, made sounds pressed. I trying find number contact Google tell mad I was. Finally restarting phone fixed it, way I've seen reviews, seems work many people. Therefore, I cannot recommend playing purchasing app. I refund hassle all, I agree reviews answer support email. Everything people say true. Do buy it. UPDATE: seems like I give permissions ask for, continue play ads. It also true ask many permissions. DON'T PLAY THIS! And I definitely ask refund.","sentiment":"POSITIVE"},{"review":"The game good fun. However allowed astronomical amount ads pop ruins fun try force go ad free. The game fun fun enough spend money make ad free. Due extremely large amount ads trying force us buy game, rate 1/5. Otherwise without ads (some ads understand, like every 20 seconds pop up) would gave 3/5","sentiment":"POSITIVE"},{"review":"It goodgame kind addictive. There many ads I know whether phone seems lot lag times? The second chance feature count rather throwing straight back in.","sentiment":"POSITIVE"},{"review":"PAYING TO REMOVE THE ADS DOES NOT WORK! This addicting fun game, issue many ads. As many games I play, I mind spending dollars remove ads... BUT IT DIDN'T REMOVE THE ADS! I still get amount ads, continually banner bottom videos levels. Paying ads nothing. The developer respond, past 48 hours get refund Google. If paying ads actually removed ads, would probably 5 star review!","sentiment":"POSITIVE"},{"review":"Game fun. But many ads! They happen lose go next level. I play 5 minutes. And ads close, wait 10-15 seconds time. And encounter add every 30 seconds (you either lose go level).","sentiment":"POSITIVE"},{"review":"This game would awesome paid $2.49 remove ads, ads actually removed. And what's permissions? Why need access contacts, location, AND phone calls? And still reply dev? Would better would make buttons work. It even restore.","sentiment":"POSITIVE"},{"review":"Great game many ads. I paid $2.49 ad free I still get many before. Tried contacting developer twice last two days response. This seems happening everyone else well. It would easily 5 stars blatantly rob people supporting content. Contacting Google I hear back Voodoo within next days.","sentiment":"POSITIVE"},{"review":"Its unbelievable amount adds. The game pretty fun honestly I could play hours end, fact I constantly assaulted adds. There already static add bottom game play choice watch add get new life fine good, top time fail instantly transported add cant get of. Its ridiculous. I spent time trying get adds game play","sentiment":"POSITIVE"},{"review":"This game bores never-ending ads. If decide buy NO ADS, charge money ads still stay there, multiplied. Their support never responds emails. If going play offline, fun relaxing game kill time. If need stay online... Then better something else.","sentiment":"NEUTRAL"},{"review":"nan","sentiment":"-"}],"appSentiment":{"POSITIVE":209,"NEGATIVE":58,"NEUTRAL":6,"-":27}},"worstAppSentiment":{"app":"Photo Editor & Candy Camera & Grid & ScrapBook","category":"ART_AND_DESIGN","rating":4.1,"reviews":159,"size":"19M","installs":"10,000+","type":"FREE","price":"$0","contentRating":{"category":"Everyone","assertion":"-","lowerLimit":"-"},"genres":["Art & Design"],"lastUpdated":1515263390000,"currentVersion":"1.0.0","androidVersion":"4.0.3 and up","translatedReviews":[],"appSentiment":{"POSITIVE":0,"NEGATIVE":0,"NEUTRAL":0,"-":0}},"mostInstalled":{"app":"Google Play Books","category":"BOOKS_AND_REFERENCE","rating":3.9,"reviews":1433233,"size":"Varies with device","installs":"1,000,000,000+","type":"FREE","price":"$0","contentRating":{"category":"Teen","assertion":"-","lowerLimit":"-"},"genres":["Books & Reference"],"lastUpdated":1533234590000,"currentVersion":"Varies with device","androidVersion":"Varies with device","translatedReviews":[{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"},{"review":"nan","sentiment":"-"}],"appSentiment":{"POSITIVE":0,"NEGATIVE":0,"NEUTRAL":0,"-":40}},"leastInstalled":{"app":"Popsicle Launcher for Android P 9.0 launcher","category":"PERSONALIZATION","rating":0,"reviews":0,"size":"5.5M","installs":"0+","type":"PAID","price":"$1.49","contentRating":{"category":"Everyone","assertion":"-","lowerLimit":"-"},"genres":["Personalization"],"lastUpdated":1531247390000,"currentVersion":"1.1","androidVersion":"4.2 and up","translatedReviews":[],"appSentiment":{"POSITIVE":0,"NEGATIVE":0,"NEUTRAL":0,"-":0}}}